1) /usr/src/myapp/src/Command/AddUserCommand.php:108    [M] NotIdentical

--- Original
+++ New
@@ @@
      */
     protected function interact(InputInterface $input, OutputInterface $output) : void
     {
-        if (null !== $input->getArgument('username') && null !== $input->getArgument('password') && null !== $input->getArgument('email') && null !== $input->getArgument('full-name')) {
+        if (null === $input->getArgument('username') && null !== $input->getArgument('password') && null !== $input->getArgument('email') && null !== $input->getArgument('full-name')) {
             return;
         }
         $this->io->title('Add User Command Interactive Wizard');

2) /usr/src/myapp/src/Command/AddUserCommand.php:108    [M] NotIdentical

--- Original
+++ New
@@ @@
      */
     protected function interact(InputInterface $input, OutputInterface $output) : void
     {
-        if (null !== $input->getArgument('username') && null !== $input->getArgument('password') && null !== $input->getArgument('email') && null !== $input->getArgument('full-name')) {
+        if (null !== $input->getArgument('username') && null === $input->getArgument('password') && null !== $input->getArgument('email') && null !== $input->getArgument('full-name')) {
             return;
         }
         $this->io->title('Add User Command Interactive Wizard');

3) /usr/src/myapp/src/Command/AddUserCommand.php:108    [M] LogicalAnd

--- Original
+++ New
@@ @@
      */
     protected function interact(InputInterface $input, OutputInterface $output) : void
     {
-        if (null !== $input->getArgument('username') && null !== $input->getArgument('password') && null !== $input->getArgument('email') && null !== $input->getArgument('full-name')) {
+        if ((null !== $input->getArgument('username') || null !== $input->getArgument('password')) && null !== $input->getArgument('email') && null !== $input->getArgument('full-name')) {
             return;
         }
         $this->io->title('Add User Command Interactive Wizard');

4) /usr/src/myapp/src/Command/AddUserCommand.php:108    [M] NotIdentical

--- Original
+++ New
@@ @@
      */
     protected function interact(InputInterface $input, OutputInterface $output) : void
     {
-        if (null !== $input->getArgument('username') && null !== $input->getArgument('password') && null !== $input->getArgument('email') && null !== $input->getArgument('full-name')) {
+        if (null !== $input->getArgument('username') && null !== $input->getArgument('password') && null === $input->getArgument('email') && null !== $input->getArgument('full-name')) {
             return;
         }
         $this->io->title('Add User Command Interactive Wizard');

5) /usr/src/myapp/src/Command/AddUserCommand.php:108    [M] LogicalAnd

--- Original
+++ New
@@ @@
      */
     protected function interact(InputInterface $input, OutputInterface $output) : void
     {
-        if (null !== $input->getArgument('username') && null !== $input->getArgument('password') && null !== $input->getArgument('email') && null !== $input->getArgument('full-name')) {
+        if ((null !== $input->getArgument('username') && null !== $input->getArgument('password') || null !== $input->getArgument('email')) && null !== $input->getArgument('full-name')) {
             return;
         }
         $this->io->title('Add User Command Interactive Wizard');

6) /usr/src/myapp/src/Command/AddUserCommand.php:108    [M] NotIdentical

--- Original
+++ New
@@ @@
      */
     protected function interact(InputInterface $input, OutputInterface $output) : void
     {
-        if (null !== $input->getArgument('username') && null !== $input->getArgument('password') && null !== $input->getArgument('email') && null !== $input->getArgument('full-name')) {
+        if (null !== $input->getArgument('username') && null !== $input->getArgument('password') && null !== $input->getArgument('email') && null === $input->getArgument('full-name')) {
             return;
         }
         $this->io->title('Add User Command Interactive Wizard');

7) /usr/src/myapp/src/Command/AddUserCommand.php:108    [M] LogicalAnd

--- Original
+++ New
@@ @@
      */
     protected function interact(InputInterface $input, OutputInterface $output) : void
     {
-        if (null !== $input->getArgument('username') && null !== $input->getArgument('password') && null !== $input->getArgument('email') && null !== $input->getArgument('full-name')) {
+        if (null !== $input->getArgument('username') && null !== $input->getArgument('password') && null !== $input->getArgument('email') || null !== $input->getArgument('full-name')) {
             return;
         }
         $this->io->title('Add User Command Interactive Wizard');

8) /usr/src/myapp/src/Command/AddUserCommand.php:112    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (null !== $input->getArgument('username') && null !== $input->getArgument('password') && null !== $input->getArgument('email') && null !== $input->getArgument('full-name')) {
             return;
         }
-        $this->io->title('Add User Command Interactive Wizard');
+        
         $this->io->text(['If you prefer to not use this interactive wizard, provide the', 'arguments required by this command as follows:', '', ' $ php bin/console app:add-user username password email@example.com', '', 'Now we\'ll ask you for the value of all the missing command arguments.']);
         // Ask for the username if it's not defined
         $username = $input->getArgument('username');

9) /usr/src/myapp/src/Command/AddUserCommand.php:113    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             return;
         }
         $this->io->title('Add User Command Interactive Wizard');
-        $this->io->text(['If you prefer to not use this interactive wizard, provide the', 'arguments required by this command as follows:', '', ' $ php bin/console app:add-user username password email@example.com', '', 'Now we\'ll ask you for the value of all the missing command arguments.']);
+        $this->io->text(['arguments required by this command as follows:', '', ' $ php bin/console app:add-user username password email@example.com', '', 'Now we\'ll ask you for the value of all the missing command arguments.']);
         // Ask for the username if it's not defined
         $username = $input->getArgument('username');
         if (null !== $username) {

10) /usr/src/myapp/src/Command/AddUserCommand.php:113    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return;
         }
         $this->io->title('Add User Command Interactive Wizard');
-        $this->io->text(['If you prefer to not use this interactive wizard, provide the', 'arguments required by this command as follows:', '', ' $ php bin/console app:add-user username password email@example.com', '', 'Now we\'ll ask you for the value of all the missing command arguments.']);
+        
         // Ask for the username if it's not defined
         $username = $input->getArgument('username');
         if (null !== $username) {

11) /usr/src/myapp/src/Command/AddUserCommand.php:175    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $email = $input->getArgument('email');
         $fullName = $input->getArgument('full-name');
         $isAdmin = $input->getOption('admin');
-        // make sure to validate the user data is correct
-        $this->validateUserData($username, $plainPassword, $email, $fullName);
+        
         // create the user and hash its password
         $user = new User();
         $user->setFullName($fullName);

12) /usr/src/myapp/src/Command/AddUserCommand.php:191    [M] Ternary

--- Original
+++ New
@@ @@
         $user->setPassword($hashedPassword);
         $this->entityManager->persist($user);
         $this->entityManager->flush();
-        $this->io->success(sprintf('%s was successfully created: %s (%s)', $isAdmin ? 'Administrator user' : 'User', $user->getUsername(), $user->getEmail()));
+        $this->io->success(sprintf('%s was successfully created: %s (%s)', $isAdmin ? 'User' : 'Administrator user', $user->getUsername(), $user->getEmail()));
         $event = $stopwatch->stop('add-user-command');
         if ($output->isVerbose()) {
             $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() / 1024 ** 2));

13) /usr/src/myapp/src/Command/AddUserCommand.php:191    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user->setPassword($hashedPassword);
         $this->entityManager->persist($user);
         $this->entityManager->flush();
-        $this->io->success(sprintf('%s was successfully created: %s (%s)', $isAdmin ? 'Administrator user' : 'User', $user->getUsername(), $user->getEmail()));
+        
         $event = $stopwatch->stop('add-user-command');
         if ($output->isVerbose()) {
             $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() / 1024 ** 2));

14) /usr/src/myapp/src/Command/AddUserCommand.php:211    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (null !== $existingUser) {
             throw new RuntimeException(sprintf('There is already a user registered with the "%s" username.', $username));
         }
-        // validate password and email if is not this input means interactive.
-        $this->validator->validatePassword($plainPassword);
+        
         $this->validator->validateEmail($email);
         $this->validator->validateFullName($fullName);
         // check if a user with the same email already exists.

15) /usr/src/myapp/src/Command/AddUserCommand.php:212    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         // validate password and email if is not this input means interactive.
         $this->validator->validatePassword($plainPassword);
-        $this->validator->validateEmail($email);
+        
         $this->validator->validateFullName($fullName);
         // check if a user with the same email already exists.
         $existingEmail = $this->users->findOneBy(['email' => $email]);

16) /usr/src/myapp/src/Command/AddUserCommand.php:213    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // validate password and email if is not this input means interactive.
         $this->validator->validatePassword($plainPassword);
         $this->validator->validateEmail($email);
-        $this->validator->validateFullName($fullName);
+        
         // check if a user with the same email already exists.
         $existingEmail = $this->users->findOneBy(['email' => $email]);
         if (null !== $existingEmail) {

17) /usr/src/myapp/src/Command/ListUsersCommand.php:80    [M] DecrementInteger

--- Original
+++ New
@@ @@
 
   <info>php %command.full_name%</info> <comment>--send-to=fabien@symfony.com</comment>
 HELP
-)->addOption('max-results', null, InputOption::VALUE_OPTIONAL, 'Limits the number of users listed', 50)->addOption('send-to', null, InputOption::VALUE_OPTIONAL, 'If set, the result is sent to the given email address');
+)->addOption('max-results', null, InputOption::VALUE_OPTIONAL, 'Limits the number of users listed', 49)->addOption('send-to', null, InputOption::VALUE_OPTIONAL, 'If set, the result is sent to the given email address');
     }
     /**
      * This method is executed after initialize(). It usually contains the logic

18) /usr/src/myapp/src/Command/ListUsersCommand.php:80    [M] IncrementInteger

--- Original
+++ New
@@ @@
 
   <info>php %command.full_name%</info> <comment>--send-to=fabien@symfony.com</comment>
 HELP
-)->addOption('max-results', null, InputOption::VALUE_OPTIONAL, 'Limits the number of users listed', 50)->addOption('send-to', null, InputOption::VALUE_OPTIONAL, 'If set, the result is sent to the given email address');
+)->addOption('max-results', null, InputOption::VALUE_OPTIONAL, 'Limits the number of users listed', 51)->addOption('send-to', null, InputOption::VALUE_OPTIONAL, 'If set, the result is sent to the given email address');
     }
     /**
      * This method is executed after initialize(). It usually contains the logic

19) /usr/src/myapp/src/Command/ListUsersCommand.php:93    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $maxResults = $input->getOption('max-results');
         // Use ->findBy() instead of ->findAll() to allow result sorting and limiting
-        $allUsers = $this->users->findBy([], ['id' => 'DESC'], $maxResults);
+        $allUsers = $this->users->findBy([], [], $maxResults);
         // Doctrine query returns an array of objects and we need an array of plain arrays
         $usersAsPlainArrays = array_map(static function (User $user) {
             return [$user->getId(), $user->getFullName(), $user->getUsername(), $user->getEmail(), implode(', ', $user->getRoles())];

20) /usr/src/myapp/src/Command/ListUsersCommand.php:97    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $allUsers = $this->users->findBy([], ['id' => 'DESC'], $maxResults);
         // Doctrine query returns an array of objects and we need an array of plain arrays
         $usersAsPlainArrays = array_map(static function (User $user) {
-            return [$user->getId(), $user->getFullName(), $user->getUsername(), $user->getEmail(), implode(', ', $user->getRoles())];
+            return [$user->getFullName(), $user->getUsername(), $user->getEmail(), implode(', ', $user->getRoles())];
         }, $allUsers);
         // In your console commands you should always use the regular output type,
         // which outputs contents directly in the console window. However, this

21) /usr/src/myapp/src/Command/ListUsersCommand.php:114    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         // to send the list of users via email with the '--send-to' option
         $bufferedOutput = new BufferedOutput();
         $io = new SymfonyStyle($input, $bufferedOutput);
-        $io->table(['ID', 'Full Name', 'Username', 'Email', 'Roles'], $usersAsPlainArrays);
+        $io->table(['Full Name', 'Username', 'Email', 'Roles'], $usersAsPlainArrays);
         // instead of just displaying the table of users, store its contents in a variable
         $usersAsATable = $bufferedOutput->fetch();
         $output->write($usersAsATable);

32) /usr/src/myapp/src/Controller/BlogController.php:112    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form = $this->createForm(CommentType::class, $comment);
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
-            $entityManager->persist($comment);
+            
             $entityManager->flush();
             // When an event is dispatched, Symfony notifies it to all the listeners
             // and subscribers registered to it. Listeners can modify the information

33) /usr/src/myapp/src/Controller/BlogController.php:120    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($form->isSubmitted() && $form->isValid()) {
             $entityManager->persist($comment);
             $entityManager->flush();
-            // When an event is dispatched, Symfony notifies it to all the listeners
-            // and subscribers registered to it. Listeners can modify the information
-            // passed in the event and they can even modify the execution flow, so
-            // there's no guarantee that the rest of this controller will be executed.
-            // See https://symfony.com/doc/current/components/event_dispatcher.html
-            $eventDispatcher->dispatch(new CommentCreatedEvent($comment));
+            
             return $this->redirectToRoute('blog_post', ['slug' => $post->getSlug()]);
         }
         return $this->render('blog/comment_form_error.html.twig', ['post' => $post, 'form' => $form->createView()]);

34) /usr/src/myapp/src/Controller/BlogController.php:153    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function search(Request $request, PostRepository $posts) : Response
     {
         $query = $request->query->get('q', '');
-        $limit = $request->query->get('l', 10);
+        $limit = $request->query->get('l', 9);
         if (!$request->isXmlHttpRequest()) {
             return $this->render('blog/search.html.twig', ['query' => $query]);
         }

35) /usr/src/myapp/src/Controller/BlogController.php:153    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function search(Request $request, PostRepository $posts) : Response
     {
         $query = $request->query->get('q', '');
-        $limit = $request->query->get('l', 10);
+        $limit = $request->query->get('l', 11);
         if (!$request->isXmlHttpRequest()) {
             return $this->render('blog/search.html.twig', ['query' => $query]);
         }

43) /usr/src/myapp/src/Controller/UserController.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
             $entityManager->flush();
-            $this->addFlash('success', 'user.updated_successfully');
+            
             return $this->redirectToRoute('user_edit');
         }
         return $this->render('user/edit.html.twig', ['user' => $user, 'form' => $form->createView()]);

44) /usr/src/myapp/src/Controller/UserController.php:48    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $this->addFlash('success', 'user.updated_successfully');
             return $this->redirectToRoute('user_edit');
         }
-        return $this->render('user/edit.html.twig', ['user' => $user, 'form' => $form->createView()]);
+        return $this->render('user/edit.html.twig', ['form' => $form->createView()]);
     }
     #[Route('/change-password', methods: ['GET', 'POST'], name: 'user_change_password')]
     public function changePassword(Request $request, UserPasswordHasherInterface $passwordHasher, EntityManagerInterface $entityManager) : Response

45) /usr/src/myapp/src/Controller/UserController.php:63    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form = $this->createForm(ChangePasswordType::class);
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
-            $user->setPassword($passwordHasher->hashPassword($user, $form->get('newPassword')->getData()));
+            
             $entityManager->flush();
             return $this->redirectToRoute('security_logout');
         }

46) /usr/src/myapp/src/Controller/UserController.php:64    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
             $user->setPassword($passwordHasher->hashPassword($user, $form->get('newPassword')->getData()));
-            $entityManager->flush();
+            
             return $this->redirectToRoute('security_logout');
         }
         return $this->render('user/change_password.html.twig', ['form' => $form->createView()]);
     }
 }

47) /usr/src/myapp/src/Entity/Comment.php:58    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->publishedAt = new \DateTime();
     }
-    #[Assert\IsTrue(message: 'comment.is_spam')]
-    public function isLegitComment() : bool
+    protected function isLegitComment() : bool
     {
         $containsInvalidCharacters = null !== u($this->content)->indexOf('@');
         return !$containsInvalidCharacters;

48) /usr/src/myapp/src/Entity/Post.php:153    [M] LogicalNot

--- Original
+++ New
@@ @@
     public function addComment(Comment $comment) : void
     {
         $comment->setPost($this);
-        if (!$this->comments->contains($comment)) {
+        if ($this->comments->contains($comment)) {
             $this->comments->add($comment);
         }
     }

49) /usr/src/myapp/src/Entity/Post.php:154    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $comment->setPost($this);
         if (!$this->comments->contains($comment)) {
-            $this->comments->add($comment);
+            
         }
     }
     public function removeComment(Comment $comment) : void

50) /usr/src/myapp/src/Entity/User.php:120    [M] UnwrapArrayUnique

--- Original
+++ New
@@ @@
         if (empty($roles)) {
             $roles[] = 'ROLE_USER';
         }
-        return array_unique($roles);
+        return $roles;
     }
     public function setRoles(array $roles) : void
     {

51) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:82    [M] InstanceOf_

--- Original
+++ New
@@ @@
         // in a Twig_Error_Runtime, we must get the original exception.
         $previousException = $exception->getPrevious();
         // Driver exception may happen in controller or in twig template rendering
-        $isDriverException = $exception instanceof DriverException || $previousException instanceof DriverException;
+        $isDriverException = true || $previousException instanceof DriverException;
         // Check if SQLite is enabled
         if ($isDriverException && $this->isSQLitePlatform() && !\extension_loaded('sqlite3')) {
             $event->setThrowable(new \Exception('PHP extension "sqlite3" must be enabled because, by default, the Symfony Demo application uses SQLite to store its information.'));

52) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:82    [M] InstanceOf_

--- Original
+++ New
@@ @@
         // in a Twig_Error_Runtime, we must get the original exception.
         $previousException = $exception->getPrevious();
         // Driver exception may happen in controller or in twig template rendering
-        $isDriverException = $exception instanceof DriverException || $previousException instanceof DriverException;
+        $isDriverException = false || $previousException instanceof DriverException;
         // Check if SQLite is enabled
         if ($isDriverException && $this->isSQLitePlatform() && !\extension_loaded('sqlite3')) {
             $event->setThrowable(new \Exception('PHP extension "sqlite3" must be enabled because, by default, the Symfony Demo application uses SQLite to store its information.'));

53) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:82    [M] InstanceOf_

--- Original
+++ New
@@ @@
         // in a Twig_Error_Runtime, we must get the original exception.
         $previousException = $exception->getPrevious();
         // Driver exception may happen in controller or in twig template rendering
-        $isDriverException = $exception instanceof DriverException || $previousException instanceof DriverException;
+        $isDriverException = $exception instanceof DriverException || true;
         // Check if SQLite is enabled
         if ($isDriverException && $this->isSQLitePlatform() && !\extension_loaded('sqlite3')) {
             $event->setThrowable(new \Exception('PHP extension "sqlite3" must be enabled because, by default, the Symfony Demo application uses SQLite to store its information.'));

54) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:82    [M] InstanceOf_

--- Original
+++ New
@@ @@
         // in a Twig_Error_Runtime, we must get the original exception.
         $previousException = $exception->getPrevious();
         // Driver exception may happen in controller or in twig template rendering
-        $isDriverException = $exception instanceof DriverException || $previousException instanceof DriverException;
+        $isDriverException = $exception instanceof DriverException || false;
         // Check if SQLite is enabled
         if ($isDriverException && $this->isSQLitePlatform() && !\extension_loaded('sqlite3')) {
             $event->setThrowable(new \Exception('PHP extension "sqlite3" must be enabled because, by default, the Symfony Demo application uses SQLite to store its information.'));

55) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:82    [M] LogicalOr

--- Original
+++ New
@@ @@
         // in a Twig_Error_Runtime, we must get the original exception.
         $previousException = $exception->getPrevious();
         // Driver exception may happen in controller or in twig template rendering
-        $isDriverException = $exception instanceof DriverException || $previousException instanceof DriverException;
+        $isDriverException = $exception instanceof DriverException && $previousException instanceof DriverException;
         // Check if SQLite is enabled
         if ($isDriverException && $this->isSQLitePlatform() && !\extension_loaded('sqlite3')) {
             $event->setThrowable(new \Exception('PHP extension "sqlite3" must be enabled because, by default, the Symfony Demo application uses SQLite to store its information.'));

56) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:85    [M] LogicalAnd

--- Original
+++ New
@@ @@
         // Driver exception may happen in controller or in twig template rendering
         $isDriverException = $exception instanceof DriverException || $previousException instanceof DriverException;
         // Check if SQLite is enabled
-        if ($isDriverException && $this->isSQLitePlatform() && !\extension_loaded('sqlite3')) {
+        if (($isDriverException || $this->isSQLitePlatform()) && !\extension_loaded('sqlite3')) {
             $event->setThrowable(new \Exception('PHP extension "sqlite3" must be enabled because, by default, the Symfony Demo application uses SQLite to store its information.'));
         }
     }

57) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:85    [M] LogicalNot

--- Original
+++ New
@@ @@
         // Driver exception may happen in controller or in twig template rendering
         $isDriverException = $exception instanceof DriverException || $previousException instanceof DriverException;
         // Check if SQLite is enabled
-        if ($isDriverException && $this->isSQLitePlatform() && !\extension_loaded('sqlite3')) {
+        if ($isDriverException && $this->isSQLitePlatform() && \extension_loaded('sqlite3')) {
             $event->setThrowable(new \Exception('PHP extension "sqlite3" must be enabled because, by default, the Symfony Demo application uses SQLite to store its information.'));
         }
     }

58) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:85    [M] LogicalAnd

--- Original
+++ New
@@ @@
         // Driver exception may happen in controller or in twig template rendering
         $isDriverException = $exception instanceof DriverException || $previousException instanceof DriverException;
         // Check if SQLite is enabled
-        if ($isDriverException && $this->isSQLitePlatform() && !\extension_loaded('sqlite3')) {
+        if ($isDriverException && $this->isSQLitePlatform() || !\extension_loaded('sqlite3')) {
             $event->setThrowable(new \Exception('PHP extension "sqlite3" must be enabled because, by default, the Symfony Demo application uses SQLite to store its information.'));
         }
     }

59) /usr/src/myapp/src/EventSubscriber/CommentNotificationSubscriber.php:50    [M] Concat

--- Original
+++ New
@@ @@
     {
         $comment = $event->getComment();
         $post = $comment->getPost();
-        $linkToPost = $this->urlGenerator->generate('blog_post', ['slug' => $post->getSlug(), '_fragment' => 'comment_' . $comment->getId()], UrlGeneratorInterface::ABSOLUTE_URL);
+        $linkToPost = $this->urlGenerator->generate('blog_post', ['slug' => $post->getSlug(), '_fragment' => $comment->getId() . 'comment_'], UrlGeneratorInterface::ABSOLUTE_URL);
         $subject = $this->translator->trans('notification.comment_created');
         $body = $this->translator->trans('notification.comment_created.description', ['title' => $post->getTitle(), 'link' => $linkToPost]);
         // See https://symfony.com/doc/current/mailer.html

60) /usr/src/myapp/src/EventSubscriber/CommentNotificationSubscriber.php:50    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $comment = $event->getComment();
         $post = $comment->getPost();
-        $linkToPost = $this->urlGenerator->generate('blog_post', ['slug' => $post->getSlug(), '_fragment' => 'comment_' . $comment->getId()], UrlGeneratorInterface::ABSOLUTE_URL);
+        $linkToPost = $this->urlGenerator->generate('blog_post', ['slug' => $post->getSlug(), '_fragment' => $comment->getId()], UrlGeneratorInterface::ABSOLUTE_URL);
         $subject = $this->translator->trans('notification.comment_created');
         $body = $this->translator->trans('notification.comment_created.description', ['title' => $post->getTitle(), 'link' => $linkToPost]);
         // See https://symfony.com/doc/current/mailer.html

61) /usr/src/myapp/src/EventSubscriber/CommentNotificationSubscriber.php:50    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $comment = $event->getComment();
         $post = $comment->getPost();
-        $linkToPost = $this->urlGenerator->generate('blog_post', ['slug' => $post->getSlug(), '_fragment' => 'comment_' . $comment->getId()], UrlGeneratorInterface::ABSOLUTE_URL);
+        $linkToPost = $this->urlGenerator->generate('blog_post', ['slug' => $post->getSlug(), '_fragment' => 'comment_'], UrlGeneratorInterface::ABSOLUTE_URL);
         $subject = $this->translator->trans('notification.comment_created');
         $body = $this->translator->trans('notification.comment_created.description', ['title' => $post->getTitle(), 'link' => $linkToPost]);
         // See https://symfony.com/doc/current/mailer.html
