22) /usr/src/myapp/src/Controller/Admin/BlogController.php:56    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     #[Route('/', methods: ['GET'], name: 'admin_post_index')]
     public function index(PostRepository $posts) : Response
     {
-        $authorPosts = $posts->findBy(['author' => $this->getUser()], ['publishedAt' => 'DESC']);
+        $authorPosts = $posts->findBy([], ['publishedAt' => 'DESC']);
         return $this->render('admin/blog/index.html.twig', ['posts' => $authorPosts]);
     }
     /**

23) /usr/src/myapp/src/Controller/Admin/BlogController.php:56    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     #[Route('/', methods: ['GET'], name: 'admin_post_index')]
     public function index(PostRepository $posts) : Response
     {
-        $authorPosts = $posts->findBy(['author' => $this->getUser()], ['publishedAt' => 'DESC']);
+        $authorPosts = $posts->findBy(['author' => $this->getUser()], []);
         return $this->render('admin/blog/index.html.twig', ['posts' => $authorPosts]);
     }
     /**

24) /usr/src/myapp/src/Controller/Admin/BlogController.php:92    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($form->isSubmitted() && $form->isValid()) {
             $entityManager->persist($post);
             $entityManager->flush();
-            // Flash messages are used to notify the user about the result of the
-            // actions. They are deleted automatically from the session as soon
-            // as they are accessed.
-            // See https://symfony.com/doc/current/controller.html#flash-messages
-            $this->addFlash('success', 'post.created_successfully');
+            
             if ($form->get('saveAndCreateNew')->isClicked()) {
                 return $this->redirectToRoute('admin_post_new');
             }

25) /usr/src/myapp/src/Controller/Admin/BlogController.php:101    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             }
             return $this->redirectToRoute('admin_post_index');
         }
-        return $this->render('admin/blog/new.html.twig', ['post' => $post, 'form' => $form->createView()]);
+        return $this->render('admin/blog/new.html.twig', ['form' => $form->createView()]);
     }
     /**
      * Finds and displays a Post entity.

26) /usr/src/myapp/src/Controller/Admin/BlogController.php:115    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     #[Route('/{id<\\d+>}', methods: ['GET'], name: 'admin_post_show')]
     public function show(Post $post) : Response
     {
-        // This security check can also be performed
-        // using a PHP attribute: #[IsGranted('show', subject: 'post', message: 'Posts can only be shown to their authors.')]
-        $this->denyAccessUnlessGranted(PostVoter::SHOW, $post, 'Posts can only be shown to their authors.');
+        
         return $this->render('admin/blog/show.html.twig', ['post' => $post]);
     }
     /**

27) /usr/src/myapp/src/Controller/Admin/BlogController.php:133    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form = $this->createForm(PostType::class, $post);
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
-            $entityManager->flush();
+            
             $this->addFlash('success', 'post.updated_successfully');
             return $this->redirectToRoute('admin_post_edit', ['id' => $post->getId()]);
         }

28) /usr/src/myapp/src/Controller/Admin/BlogController.php:134    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $form->handleRequest($request);
         if ($form->isSubmitted() && $form->isValid()) {
             $entityManager->flush();
-            $this->addFlash('success', 'post.updated_successfully');
+            
             return $this->redirectToRoute('admin_post_edit', ['id' => $post->getId()]);
         }
         return $this->render('admin/blog/edit.html.twig', ['post' => $post, 'form' => $form->createView()]);

29) /usr/src/myapp/src/Controller/Admin/BlogController.php:159    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (!$this->isCsrfTokenValid('delete', $request->request->get('token'))) {
             return $this->redirectToRoute('admin_post_index');
         }
-        // Delete the tags associated with this blog post. This is done automatically
-        // by Doctrine, except for SQLite (the database used in this application)
-        // because foreign key support is not enabled by default in SQLite
-        $post->getTags()->clear();
+        
         $entityManager->remove($post);
         $entityManager->flush();
         $this->addFlash('success', 'post.deleted_successfully');

30) /usr/src/myapp/src/Controller/Admin/BlogController.php:164    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $post->getTags()->clear();
         $entityManager->remove($post);
         $entityManager->flush();
-        $this->addFlash('success', 'post.deleted_successfully');
+        
         return $this->redirectToRoute('admin_post_index');
     }
 }

42) /usr/src/myapp/src/Controller/SecurityController.php:44    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($this->getUser()) {
             return $this->redirectToRoute('blog_index');
         }
-        // this statement solves an edge-case: if you change the locale in the login
-        // page, after a successful login you are redirected to a page in the previous
-        // locale. This code regenerates the referrer URL whenever the login page is
-        // browsed, to ensure that its locale is always the current one.
-        $this->saveTargetPath($request->getSession(), 'main', $this->generateUrl('admin_index'));
+        
         return $this->render('security/login.html.twig', [
             // last username entered by the user (if any)
             'last_username' => $helper->getLastUsername(),

145) /usr/src/myapp/src/Security/PostVoter.php:41    [M] InstanceOf_

--- Original
+++ New
@@ @@
     protected function supports(string $attribute, $subject) : bool
     {
         // this voter is only executed on Post objects and for three specific permissions
-        return $subject instanceof Post && \in_array($attribute, [self::SHOW, self::EDIT, self::DELETE], true);
+        return true && \in_array($attribute, [self::SHOW, self::EDIT, self::DELETE], true);
     }
     /**
      * {@inheritdoc}

146) /usr/src/myapp/src/Security/PostVoter.php:41    [M] LogicalAnd

--- Original
+++ New
@@ @@
     protected function supports(string $attribute, $subject) : bool
     {
         // this voter is only executed on Post objects and for three specific permissions
-        return $subject instanceof Post && \in_array($attribute, [self::SHOW, self::EDIT, self::DELETE], true);
+        return $subject instanceof Post || \in_array($attribute, [self::SHOW, self::EDIT, self::DELETE], true);
     }
     /**
      * {@inheritdoc}

147) /usr/src/myapp/src/Security/PostVoter.php:54    [M] InstanceOf_

--- Original
+++ New
@@ @@
     {
         $user = $token->getUser();
         // the user must be logged in; if not, deny permission
-        if (!$user instanceof User) {
+        if (!true) {
             return false;
         }
         // the logic of this voter is pretty simple: if the logged user is the

41) /usr/src/myapp/src/Controller/Admin/BlogController.php:52    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      *     could move this annotation to any other controller while maintaining
      *     the route name and therefore, without breaking any existing link.
      */
-    #[Route('/', methods: ['GET'], name: 'admin_index')]
+    #[Route('/', methods: [], name: 'admin_index')]
     #[Route('/', methods: ['GET'], name: 'admin_post_index')]
     public function index(PostRepository $posts) : Response
     {

42) /usr/src/myapp/src/Controller/Admin/BlogController.php:53    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      *     the route name and therefore, without breaking any existing link.
      */
     #[Route('/', methods: ['GET'], name: 'admin_index')]
-    #[Route('/', methods: ['GET'], name: 'admin_post_index')]
+    #[Route('/', methods: [], name: 'admin_post_index')]
     public function index(PostRepository $posts) : Response
     {
         $authorPosts = $posts->findBy(['author' => $this->getUser()], ['publishedAt' => 'DESC']);

43) /usr/src/myapp/src/Controller/Admin/BlogController.php:68    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      * to constraint the HTTP methods each controller responds to (by default
      * it responds to all methods).
      */
-    #[Route('/new', methods: ['GET', 'POST'], name: 'admin_post_new')]
+    #[Route('/new', methods: ['POST'], name: 'admin_post_new')]
     public function new(Request $request, EntityManagerInterface $entityManager) : Response
     {
         $post = new Post();

44) /usr/src/myapp/src/Controller/Admin/BlogController.php:110    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     /**
      * Finds and displays a Post entity.
      */
-    #[Route('/{id<\\d+>}', methods: ['GET'], name: 'admin_post_show')]
+    #[Route('/{id<\\d+>}', methods: [], name: 'admin_post_show')]
     public function show(Post $post) : Response
     {
         // This security check can also be performed

45) /usr/src/myapp/src/Controller/Admin/BlogController.php:125    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     /**
      * Displays a form to edit an existing Post entity.
      */
-    #[Route('/{id<\\d+>}/edit', methods: ['GET', 'POST'], name: 'admin_post_edit')]
+    #[Route('/{id<\\d+>}/edit', methods: ['POST'], name: 'admin_post_edit')]
     #[IsGranted('edit', subject: 'post', message: 'Posts can only be edited by their authors.')]
     public function edit(Request $request, Post $post, EntityManagerInterface $entityManager) : Response
     {

46) /usr/src/myapp/src/Controller/Admin/BlogController.php:148    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     /**
      * Deletes a Post entity.
      */
-    #[Route('/{id}/delete', methods: ['POST'], name: 'admin_post_delete')]
+    #[Route('/{id}/delete', methods: [], name: 'admin_post_delete')]
     #[IsGranted('delete', subject: 'post')]
     public function delete(Request $request, Post $post, EntityManagerInterface $entityManager) : Response
     {

65) /usr/src/myapp/src/Controller/SecurityController.php:60    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * But, this will never be executed. Symfony will intercept this first
      * and handle the logout automatically. See logout in config/packages/security.yaml
      */
-    #[Route('/logout', name: 'security_logout')]
-    public function logout() : void
+    protected function logout() : void
     {
         throw new \Exception('This should never be reached!');
     }
 }

66) /usr/src/myapp/src/Controller/SecurityController.php:63    [M] Throw_

--- Original
+++ New
@@ @@
     #[Route('/logout', name: 'security_logout')]
     public function logout() : void
     {
-        throw new \Exception('This should never be reached!');
+        new \Exception('This should never be reached!');
     }
 }
