62) /usr/src/myapp/src/EventSubscriber/CommentNotificationSubscriber.php:54    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $post = $comment->getPost();
         $linkToPost = $this->urlGenerator->generate('blog_post', ['slug' => $post->getSlug(), '_fragment' => 'comment_' . $comment->getId()], UrlGeneratorInterface::ABSOLUTE_URL);
         $subject = $this->translator->trans('notification.comment_created');
-        $body = $this->translator->trans('notification.comment_created.description', ['title' => $post->getTitle(), 'link' => $linkToPost]);
+        $body = $this->translator->trans('notification.comment_created.description', ['link' => $linkToPost]);
         // See https://symfony.com/doc/current/mailer.html
         $email = (new Email())->from($this->sender)->to($post->getAuthor()->getEmail())->subject($subject)->html($body);
         // In config/packages/dev/mailer.yaml the delivery of messages is disabled.

63) /usr/src/myapp/src/EventSubscriber/CommentNotificationSubscriber.php:55    [M] ArrayItem

--- Original
+++ New
@@ @@
         $post = $comment->getPost();
         $linkToPost = $this->urlGenerator->generate('blog_post', ['slug' => $post->getSlug(), '_fragment' => 'comment_' . $comment->getId()], UrlGeneratorInterface::ABSOLUTE_URL);
         $subject = $this->translator->trans('notification.comment_created');
-        $body = $this->translator->trans('notification.comment_created.description', ['title' => $post->getTitle(), 'link' => $linkToPost]);
+        $body = $this->translator->trans('notification.comment_created.description', ['title' > $post->getTitle(), 'link' => $linkToPost]);
         // See https://symfony.com/doc/current/mailer.html
         $email = (new Email())->from($this->sender)->to($post->getAuthor()->getEmail())->subject($subject)->html($body);
         // In config/packages/dev/mailer.yaml the delivery of messages is disabled.

64) /usr/src/myapp/src/EventSubscriber/CommentNotificationSubscriber.php:70    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $body = $this->translator->trans('notification.comment_created.description', ['title' => $post->getTitle(), 'link' => $linkToPost]);
         // See https://symfony.com/doc/current/mailer.html
         $email = (new Email())->from($this->sender)->to($post->getAuthor()->getEmail())->subject($subject)->html($body);
-        // In config/packages/dev/mailer.yaml the delivery of messages is disabled.
-        // That's why in the development environment you won't actually receive any email.
-        // However, you can inspect the contents of those unsent emails using the debug toolbar.
-        $this->mailer->send($email);
+        
     }
 }

65) /usr/src/myapp/src/EventSubscriber/ControllerSubscriber.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // number of sub-requests. See
         // https://symfony.com/doc/current/components/http_kernel.html#sub-requests
         if ($event->isMainRequest()) {
-            $this->twigExtension->setController($event->getController());
+            
         }
     }
 }

66) /usr/src/myapp/src/EventSubscriber/RedirectToPreferredLocaleSubscriber.php:39    [M] UnwrapTrim

--- Original
+++ New
@@ @@
     private string $defaultLocale;
     public function __construct(private UrlGeneratorInterface $urlGenerator, string $locales, ?string $defaultLocale = null)
     {
-        $this->locales = explode('|', trim($locales));
+        $this->locales = explode('|', $locales);
         if (empty($this->locales)) {
             throw new \UnexpectedValueException('The list of supported locales must not be empty.');
         }

67) /usr/src/myapp/src/EventSubscriber/RedirectToPreferredLocaleSubscriber.php:44    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if (empty($this->locales)) {
             throw new \UnexpectedValueException('The list of supported locales must not be empty.');
         }
-        $this->defaultLocale = $defaultLocale ?: $this->locales[0];
+        $this->defaultLocale = $defaultLocale ?: $this->locales[1];
         if (!\in_array($this->defaultLocale, $this->locales, true)) {
             throw new \UnexpectedValueException(sprintf('The default locale ("%s") must be one of "%s".', $this->defaultLocale, $locales));
         }

68) /usr/src/myapp/src/EventSubscriber/RedirectToPreferredLocaleSubscriber.php:53    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         if (!\in_array($this->defaultLocale, $this->locales, true)) {
             throw new \UnexpectedValueException(sprintf('The default locale ("%s") must be one of "%s".', $this->defaultLocale, $locales));
         }
-        // Add the default locale at the first position of the array,
-        // because Symfony\HttpFoundation\Request::getPreferredLanguage
-        // returns the first element when no an appropriate language is found
-        array_unshift($this->locales, $this->defaultLocale);
+        
         $this->locales = array_unique($this->locales);
     }
     public static function getSubscribedEvents() : array

69) /usr/src/myapp/src/EventSubscriber/RedirectToPreferredLocaleSubscriber.php:54    [M] UnwrapArrayUnique

--- Original
+++ New
@@ @@
         // because Symfony\HttpFoundation\Request::getPreferredLanguage
         // returns the first element when no an appropriate language is found
         array_unshift($this->locales, $this->defaultLocale);
-        $this->locales = array_unique($this->locales);
+        $this->locales = $this->locales;
     }
     public static function getSubscribedEvents() : array
     {

70) /usr/src/myapp/src/EventSubscriber/RedirectToPreferredLocaleSubscriber.php:69    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
         $request = $event->getRequest();
         // Ignore sub-requests and all URLs but the homepage
-        if (!$event->isMainRequest() || '/' !== $request->getPathInfo()) {
+        if ($event->isMainRequest() || '/' !== $request->getPathInfo()) {
             return;
         }
         // Ignore requests from referrers with the same HTTP host in order to prevent

71) /usr/src/myapp/src/EventSubscriber/RedirectToPreferredLocaleSubscriber.php:69    [M] NotIdentical

--- Original
+++ New
@@ @@
     {
         $request = $event->getRequest();
         // Ignore sub-requests and all URLs but the homepage
-        if (!$event->isMainRequest() || '/' !== $request->getPathInfo()) {
+        if (!$event->isMainRequest() || '/' === $request->getPathInfo()) {
             return;
         }
         // Ignore requests from referrers with the same HTTP host in order to prevent

72) /usr/src/myapp/src/EventSubscriber/RedirectToPreferredLocaleSubscriber.php:69    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
         $request = $event->getRequest();
         // Ignore sub-requests and all URLs but the homepage
-        if (!$event->isMainRequest() || '/' !== $request->getPathInfo()) {
+        if (!$event->isMainRequest() && '/' !== $request->getPathInfo()) {
             return;
         }
         // Ignore requests from referrers with the same HTTP host in order to prevent

73) /usr/src/myapp/src/EventSubscriber/RedirectToPreferredLocaleSubscriber.php:75    [M] NotIdentical

--- Original
+++ New
@@ @@
         // Ignore requests from referrers with the same HTTP host in order to prevent
         // changing language for users who possibly already selected it for this application.
         $referrer = $request->headers->get('referer');
-        if (null !== $referrer && u($referrer)->ignoreCase()->startsWith($request->getSchemeAndHttpHost())) {
+        if (null === $referrer && u($referrer)->ignoreCase()->startsWith($request->getSchemeAndHttpHost())) {
             return;
         }
         $preferredLanguage = $request->getPreferredLanguage($this->locales);

74) /usr/src/myapp/src/EventSubscriber/RedirectToPreferredLocaleSubscriber.php:75    [M] LogicalAnd

--- Original
+++ New
@@ @@
         // Ignore requests from referrers with the same HTTP host in order to prevent
         // changing language for users who possibly already selected it for this application.
         $referrer = $request->headers->get('referer');
-        if (null !== $referrer && u($referrer)->ignoreCase()->startsWith($request->getSchemeAndHttpHost())) {
+        if (null !== $referrer || u($referrer)->ignoreCase()->startsWith($request->getSchemeAndHttpHost())) {
             return;
         }
         $preferredLanguage = $request->getPreferredLanguage($this->locales);

75) /usr/src/myapp/src/Form/CommentType.php:44    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         // server-side validation errors from the browser. To temporarily disable
         // this validation, set the 'required' attribute to 'false':
         // $builder->add('content', null, ['required' => false]);
-        $builder->add('content', TextareaType::class, ['help' => 'help.comment_content']);
+        $builder->add('content', TextareaType::class, []);
     }
     /**
      * {@inheritdoc}

76) /usr/src/myapp/src/Form/CommentType.php:55    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function configureOptions(OptionsResolver $resolver) : void
     {
-        $resolver->setDefaults(['data_class' => Comment::class]);
+        $resolver->setDefaults([]);
     }
 }

77) /usr/src/myapp/src/Form/CommentType.php:55    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function configureOptions(OptionsResolver $resolver) : void
     {
-        $resolver->setDefaults(['data_class' => Comment::class]);
+        
     }
 }

78) /usr/src/myapp/src/Form/DataTransformer/TagArrayToStringTransformer.php:53    [M] LogicalOr

--- Original
+++ New
@@ @@
      */
     public function reverseTransform($string) : array
     {
-        if (null === $string || u($string)->isEmpty()) {
+        if (null === $string && u($string)->isEmpty()) {
             return [];
         }
         $names = array_filter(array_unique(array_map('trim', u($string)->split(','))));

90) /usr/src/myapp/src/Form/PostType.php:82    [M] LogicalAnd

--- Original
+++ New
@@ @@
             /** @var Post */
             $post = $event->getData();
-            if (null === $post->getSlug() && null !== $post->getTitle()) {
+            if (null === $post->getSlug() || null !== $post->getTitle()) {
                 $post->setSlug($this->slugger->slug($post->getTitle())->lower());
             }
         });

91) /usr/src/myapp/src/Form/PostType.php:94    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function configureOptions(OptionsResolver $resolver) : void
     {
-        $resolver->setDefaults(['data_class' => Post::class]);
+        $resolver->setDefaults([]);
     }
 }

92) /usr/src/myapp/src/Form/PostType.php:94    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function configureOptions(OptionsResolver $resolver) : void
     {
-        $resolver->setDefaults(['data_class' => Post::class]);
+        
     }
 }

105) /usr/src/myapp/src/Form/Type/DateTimePickerType.php:51    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function configureOptions(OptionsResolver $resolver) : void
     {
-        $resolver->setDefaults([
-            'widget' => 'single_text',
-            // if true, the browser will display the native date picker widget
-            // however, this app uses a custom JavaScript widget, so it must be set to false
-            'html5' => false,
-        ]);
+        
     }
     /**
      * {@inheritdoc}

106) /usr/src/myapp/src/Form/Type/DateTimePickerType.php:55    [M] FalseValue

--- Original
+++ New
@@ @@
             'widget' => 'single_text',
             // if true, the browser will display the native date picker widget
             // however, this app uses a custom JavaScript widget, so it must be set to false
-            'html5' => false,
+            'html5' => true,
         ]);
     }
     /**

107) /usr/src/myapp/src/Form/Type/TagsInputType.php:48    [M] TrueValue

--- Original
+++ New
@@ @@
      */
     public function buildForm(FormBuilderInterface $builder, array $options) : void
     {
-        $builder->addModelTransformer(new CollectionToArrayTransformer(), true)->addModelTransformer(new TagArrayToStringTransformer($this->tags), true);
+        $builder->addModelTransformer(new CollectionToArrayTransformer(), false)->addModelTransformer(new TagArrayToStringTransformer($this->tags), true);
     }
     /**
      * {@inheritdoc}

108) /usr/src/myapp/src/Form/UserType.php:43    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         // server-side validation errors from the browser. To temporarily disable
         // this validation, set the 'required' attribute to 'false':
         // $builder->add('title', null, ['required' => false, ...]);
-        $builder->add('username', TextType::class, ['label' => 'label.username', 'disabled' => true])->add('fullName', TextType::class, ['label' => 'label.fullname'])->add('email', EmailType::class, ['label' => 'label.email']);
+        $builder->add('username', TextType::class, ['disabled' => true])->add('fullName', TextType::class, ['label' => 'label.fullname'])->add('email', EmailType::class, ['label' => 'label.email']);
     }
     /**
      * {@inheritdoc}

109) /usr/src/myapp/src/Form/UserType.php:45    [M] TrueValue

--- Original
+++ New
@@ @@
         // server-side validation errors from the browser. To temporarily disable
         // this validation, set the 'required' attribute to 'false':
         // $builder->add('title', null, ['required' => false, ...]);
-        $builder->add('username', TextType::class, ['label' => 'label.username', 'disabled' => true])->add('fullName', TextType::class, ['label' => 'label.fullname'])->add('email', EmailType::class, ['label' => 'label.email']);
+        $builder->add('username', TextType::class, ['label' => 'label.username', 'disabled' => false])->add('fullName', TextType::class, ['label' => 'label.fullname'])->add('email', EmailType::class, ['label' => 'label.email']);
     }
     /**
      * {@inheritdoc}

110) /usr/src/myapp/src/Form/UserType.php:47    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         // server-side validation errors from the browser. To temporarily disable
         // this validation, set the 'required' attribute to 'false':
         // $builder->add('title', null, ['required' => false, ...]);
-        $builder->add('username', TextType::class, ['label' => 'label.username', 'disabled' => true])->add('fullName', TextType::class, ['label' => 'label.fullname'])->add('email', EmailType::class, ['label' => 'label.email']);
+        $builder->add('username', TextType::class, ['label' => 'label.username', 'disabled' => true])->add('fullName', TextType::class, [])->add('email', EmailType::class, ['label' => 'label.email']);
     }
     /**
      * {@inheritdoc}

111) /usr/src/myapp/src/Form/UserType.php:50    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         // server-side validation errors from the browser. To temporarily disable
         // this validation, set the 'required' attribute to 'false':
         // $builder->add('title', null, ['required' => false, ...]);
-        $builder->add('username', TextType::class, ['label' => 'label.username', 'disabled' => true])->add('fullName', TextType::class, ['label' => 'label.fullname'])->add('email', EmailType::class, ['label' => 'label.email']);
+        $builder->add('username', TextType::class, ['label' => 'label.username', 'disabled' => true])->add('fullName', TextType::class, ['label' => 'label.fullname'])->add('email', EmailType::class, []);
     }
     /**
      * {@inheritdoc}

112) /usr/src/myapp/src/Form/UserType.php:61    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function configureOptions(OptionsResolver $resolver) : void
     {
-        $resolver->setDefaults(['data_class' => User::class]);
+        $resolver->setDefaults([]);
     }
 }

113) /usr/src/myapp/src/Form/UserType.php:61    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function configureOptions(OptionsResolver $resolver) : void
     {
-        $resolver->setDefaults(['data_class' => User::class]);
+        
     }
 }

114) /usr/src/myapp/src/Pagination/Paginator.php:41    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(private DoctrineQueryBuilder $queryBuilder, private int $pageSize = self::PAGE_SIZE)
     {
     }
-    public function paginate(int $page = 1) : self
+    public function paginate(int $page = 0) : self
     {
         $this->currentPage = max(1, $page);
         $firstResult = ($this->currentPage - 1) * $this->pageSize;

115) /usr/src/myapp/src/Pagination/Paginator.php:41    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(private DoctrineQueryBuilder $queryBuilder, private int $pageSize = self::PAGE_SIZE)
     {
     }
-    public function paginate(int $page = 1) : self
+    public function paginate(int $page = 2) : self
     {
         $this->currentPage = max(1, $page);
         $firstResult = ($this->currentPage - 1) * $this->pageSize;

116) /usr/src/myapp/src/Pagination/Paginator.php:43    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function paginate(int $page = 1) : self
     {
-        $this->currentPage = max(1, $page);
+        $this->currentPage = max(0, $page);
         $firstResult = ($this->currentPage - 1) * $this->pageSize;
         $query = $this->queryBuilder->setFirstResult($firstResult)->setMaxResults($this->pageSize)->getQuery();
         if (0 === \count($this->queryBuilder->getDQLPart('join'))) {

117) /usr/src/myapp/src/Pagination/Paginator.php:43    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function paginate(int $page = 1) : self
     {
-        $this->currentPage = max(1, $page);
+        $this->currentPage = max(2, $page);
         $firstResult = ($this->currentPage - 1) * $this->pageSize;
         $query = $this->queryBuilder->setFirstResult($firstResult)->setMaxResults($this->pageSize)->getQuery();
         if (0 === \count($this->queryBuilder->getDQLPart('join'))) {

118) /usr/src/myapp/src/Pagination/Paginator.php:44    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function paginate(int $page = 1) : self
     {
         $this->currentPage = max(1, $page);
-        $firstResult = ($this->currentPage - 1) * $this->pageSize;
+        $firstResult = ($this->currentPage - 0) * $this->pageSize;
         $query = $this->queryBuilder->setFirstResult($firstResult)->setMaxResults($this->pageSize)->getQuery();
         if (0 === \count($this->queryBuilder->getDQLPart('join'))) {
             $query->setHint(CountWalker::HINT_DISTINCT, false);

119) /usr/src/myapp/src/Pagination/Paginator.php:44    [M] Minus

--- Original
+++ New
@@ @@
     public function paginate(int $page = 1) : self
     {
         $this->currentPage = max(1, $page);
-        $firstResult = ($this->currentPage - 1) * $this->pageSize;
+        $firstResult = ($this->currentPage + 1) * $this->pageSize;
         $query = $this->queryBuilder->setFirstResult($firstResult)->setMaxResults($this->pageSize)->getQuery();
         if (0 === \count($this->queryBuilder->getDQLPart('join'))) {
             $query->setHint(CountWalker::HINT_DISTINCT, false);

120) /usr/src/myapp/src/Pagination/Paginator.php:44    [M] Multiplication

--- Original
+++ New
@@ @@
     public function paginate(int $page = 1) : self
     {
         $this->currentPage = max(1, $page);
-        $firstResult = ($this->currentPage - 1) * $this->pageSize;
+        $firstResult = ($this->currentPage - 1) / $this->pageSize;
         $query = $this->queryBuilder->setFirstResult($firstResult)->setMaxResults($this->pageSize)->getQuery();
         if (0 === \count($this->queryBuilder->getDQLPart('join'))) {
             $query->setHint(CountWalker::HINT_DISTINCT, false);

121) /usr/src/myapp/src/Pagination/Paginator.php:51    [M] Identical

--- Original
+++ New
@@ @@
         $this->currentPage = max(1, $page);
         $firstResult = ($this->currentPage - 1) * $this->pageSize;
         $query = $this->queryBuilder->setFirstResult($firstResult)->setMaxResults($this->pageSize)->getQuery();
-        if (0 === \count($this->queryBuilder->getDQLPart('join'))) {
+        if (0 !== \count($this->queryBuilder->getDQLPart('join'))) {
             $query->setHint(CountWalker::HINT_DISTINCT, false);
         }
         $paginator = new DoctrinePaginator($query, true);

122) /usr/src/myapp/src/Pagination/Paginator.php:57    [M] GreaterThan

--- Original
+++ New
@@ @@
             $query->setHint(CountWalker::HINT_DISTINCT, false);
         }
         $paginator = new DoctrinePaginator($query, true);
-        $useOutputWalkers = \count($this->queryBuilder->getDQLPart('having') ?: []) > 0;
+        $useOutputWalkers = \count($this->queryBuilder->getDQLPart('having') ?: []) >= 0;
         $paginator->setUseOutputWalkers($useOutputWalkers);
         $this->results = $paginator->getIterator();
         $this->numResults = $paginator->count();

123) /usr/src/myapp/src/Pagination/Paginator.php:57    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
             $query->setHint(CountWalker::HINT_DISTINCT, false);
         }
         $paginator = new DoctrinePaginator($query, true);
-        $useOutputWalkers = \count($this->queryBuilder->getDQLPart('having') ?: []) > 0;
+        $useOutputWalkers = \count($this->queryBuilder->getDQLPart('having') ?: []) <= 0;
         $paginator->setUseOutputWalkers($useOutputWalkers);
         $this->results = $paginator->getIterator();
         $this->numResults = $paginator->count();

124) /usr/src/myapp/src/Pagination/Paginator.php:58    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $paginator = new DoctrinePaginator($query, true);
         $useOutputWalkers = \count($this->queryBuilder->getDQLPart('having') ?: []) > 0;
-        $paginator->setUseOutputWalkers($useOutputWalkers);
+        
         $this->results = $paginator->getIterator();
         $this->numResults = $paginator->count();
         return $this;

125) /usr/src/myapp/src/Pagination/Paginator.php:73    [M] Division

--- Original
+++ New
@@ @@
     }
     public function getLastPage() : int
     {
-        return (int) ceil($this->numResults / $this->pageSize);
+        return (int) ceil($this->numResults * $this->pageSize);
     }
     public function getPageSize() : int
     {

126) /usr/src/myapp/src/Pagination/Paginator.php:73    [M] RoundingFamily

--- Original
+++ New
@@ @@
     }
     public function getLastPage() : int
     {
-        return (int) ceil($this->numResults / $this->pageSize);
+        return (int) floor($this->numResults / $this->pageSize);
     }
     public function getPageSize() : int
     {

127) /usr/src/myapp/src/Pagination/Paginator.php:73    [M] RoundingFamily

--- Original
+++ New
@@ @@
     }
     public function getLastPage() : int
     {
-        return (int) ceil($this->numResults / $this->pageSize);
+        return (int) round($this->numResults / $this->pageSize);
     }
     public function getPageSize() : int
     {

128) /usr/src/myapp/src/Pagination/Paginator.php:73    [M] CastInt

--- Original
+++ New
@@ @@
     }
     public function getLastPage() : int
     {
-        return (int) ceil($this->numResults / $this->pageSize);
+        return ceil($this->numResults / $this->pageSize);
     }
     public function getPageSize() : int
     {

129) /usr/src/myapp/src/Pagination/Paginator.php:83    [M] GreaterThan

--- Original
+++ New
@@ @@
     }
     public function hasPreviousPage() : bool
     {
-        return $this->currentPage > 1;
+        return $this->currentPage >= 1;
     }
     public function getPreviousPage() : int
     {

130) /usr/src/myapp/src/Pagination/Paginator.php:83    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     }
     public function hasPreviousPage() : bool
     {
-        return $this->currentPage > 1;
+        return $this->currentPage <= 1;
     }
     public function getPreviousPage() : int
     {

131) /usr/src/myapp/src/Pagination/Paginator.php:93    [M] LessThan

--- Original
+++ New
@@ @@
     }
     public function hasNextPage() : bool
     {
-        return $this->currentPage < $this->getLastPage();
+        return $this->currentPage <= $this->getLastPage();
     }
     public function getNextPage() : int
     {

132) /usr/src/myapp/src/Pagination/Paginator.php:93    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
     }
     public function hasNextPage() : bool
     {
-        return $this->currentPage < $this->getLastPage();
+        return $this->currentPage >= $this->getLastPage();
     }
     public function getNextPage() : int
     {

133) /usr/src/myapp/src/Pagination/Paginator.php:96    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->currentPage < $this->getLastPage();
     }
-    public function getNextPage() : int
+    protected function getNextPage() : int
     {
         return min($this->getLastPage(), $this->currentPage + 1);
     }

134) /usr/src/myapp/src/Pagination/Paginator.php:98    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function getNextPage() : int
     {
-        return min($this->getLastPage(), $this->currentPage + 1);
+        return min($this->getLastPage(), $this->currentPage + 0);
     }
     public function hasToPaginate() : bool
     {

135) /usr/src/myapp/src/Pagination/Paginator.php:98    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function getNextPage() : int
     {
-        return min($this->getLastPage(), $this->currentPage + 1);
+        return min($this->getLastPage(), $this->currentPage + 2);
     }
     public function hasToPaginate() : bool
     {

136) /usr/src/myapp/src/Pagination/Paginator.php:103    [M] GreaterThan

--- Original
+++ New
@@ @@
     }
     public function hasToPaginate() : bool
     {
-        return $this->numResults > $this->pageSize;
+        return $this->numResults >= $this->pageSize;
     }
     public function getNumResults() : int
     {

137) /usr/src/myapp/src/Pagination/Paginator.php:103    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     }
     public function hasToPaginate() : bool
     {
-        return $this->numResults > $this->pageSize;
+        return $this->numResults <= $this->pageSize;
     }
     public function getNumResults() : int
     {

138) /usr/src/myapp/src/Repository/PostRepository.php:38    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         parent::__construct($registry, Post::class);
     }
-    public function findLatest(int $page = 1, Tag $tag = null) : Paginator
+    public function findLatest(int $page = 0, Tag $tag = null) : Paginator
     {
         $qb = $this->createQueryBuilder('p')->addSelect('a', 't')->innerJoin('p.author', 'a')->leftJoin('p.tags', 't')->where('p.publishedAt <= :now')->orderBy('p.publishedAt', 'DESC')->setParameter('now', new \DateTime());
         if (null !== $tag) {

139) /usr/src/myapp/src/Repository/PostRepository.php:38    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         parent::__construct($registry, Post::class);
     }
-    public function findLatest(int $page = 1, Tag $tag = null) : Paginator
+    public function findLatest(int $page = 2, Tag $tag = null) : Paginator
     {
         $qb = $this->createQueryBuilder('p')->addSelect('a', 't')->innerJoin('p.author', 'a')->leftJoin('p.tags', 't')->where('p.publishedAt <= :now')->orderBy('p.publishedAt', 'DESC')->setParameter('now', new \DateTime());
         if (null !== $tag) {

140) /usr/src/myapp/src/Repository/PostRepository.php:73    [M] Concat

--- Original
+++ New
@@ @@
         }
         $queryBuilder = $this->createQueryBuilder('p');
         foreach ($searchTerms as $key => $term) {
-            $queryBuilder->orWhere('p.title LIKE :t_' . $key)->setParameter('t_' . $key, '%' . $term . '%');
+            $queryBuilder->orWhere('p.title LIKE :t_' . $key)->setParameter('t_' . $key, $term . '%' . '%');
         }
         return $queryBuilder->orderBy('p.publishedAt', 'DESC')->setMaxResults($limit)->getQuery()->getResult();
     }

141) /usr/src/myapp/src/Repository/PostRepository.php:73    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         }
         $queryBuilder = $this->createQueryBuilder('p');
         foreach ($searchTerms as $key => $term) {
-            $queryBuilder->orWhere('p.title LIKE :t_' . $key)->setParameter('t_' . $key, '%' . $term . '%');
+            $queryBuilder->orWhere('p.title LIKE :t_' . $key)->setParameter('t_' . $key, $term . '%');
         }
         return $queryBuilder->orderBy('p.publishedAt', 'DESC')->setMaxResults($limit)->getQuery()->getResult();
     }

142) /usr/src/myapp/src/Repository/PostRepository.php:90    [M] UnwrapArrayUnique

--- Original
+++ New
@@ @@
     private function extractSearchTerms(string $searchQuery) : array
     {
         $searchQuery = u($searchQuery)->replaceMatches('/[[:space:]]+/', ' ')->trim();
-        $terms = array_unique($searchQuery->split(' '));
+        $terms = $searchQuery->split(' ');
         // ignore the search terms that are too short
         return array_filter($terms, static function ($term) {
             return 2 <= $term->length();

143) /usr/src/myapp/src/Repository/PostRepository.php:93    [M] UnwrapArrayFilter

--- Original
+++ New
@@ @@
         $searchQuery = u($searchQuery)->replaceMatches('/[[:space:]]+/', ' ')->trim();
         $terms = array_unique($searchQuery->split(' '));
         // ignore the search terms that are too short
-        return array_filter($terms, static function ($term) {
-            return 2 <= $term->length();
-        });
+        return $terms;
     }
 }
