144) /usr/src/myapp/src/Repository/PostRepository.php:94    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
         $terms = array_unique($searchQuery->split(' '));
         // ignore the search terms that are too short
         return array_filter($terms, static function ($term) {
-            return 2 <= $term->length();
+            return 2 < $term->length();
         });
     }
 }

149) /usr/src/myapp/src/Twig/AppExtension.php:35    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     public function __construct(string $locales)
     {
         $localeCodes = explode('|', $locales);
-        sort($localeCodes);
+        
         $this->localeCodes = $localeCodes;
     }
     /**

150) /usr/src/myapp/src/Twig/AppExtension.php:61    [M] Foreach_

--- Original
+++ New
@@ @@
             return $this->locales;
         }
         $this->locales = [];
-        foreach ($this->localeCodes as $localeCode) {
+        foreach (array() as $localeCode) {
             $this->locales[] = ['code' => $localeCode, 'name' => Locales::getName($localeCode, $localeCode)];
         }
         return $this->locales;
     }
 }

151) /usr/src/myapp/src/Twig/SourceCodeExtension.php:62    [M] Identical

--- Original
+++ New
@@ @@
     private function getController() : ?array
     {
         // this happens for example for exceptions (404 errors, etc.)
-        if (null === $this->controller) {
+        if (null !== $this->controller) {
             return null;
         }
         $method = $this->getCallableReflector($this->controller);

152) /usr/src/myapp/src/Twig/SourceCodeExtension.php:68    [M] FalseValue

--- Original
+++ New
@@ @@
             return null;
         }
         $method = $this->getCallableReflector($this->controller);
-        if (false === ($classCode = file($method->getFileName()))) {
+        if (true === ($classCode = file($method->getFileName()))) {
             throw new \LogicException(sprintf('There was an error while trying to read the contents of the "%s" file.', $method->getFileName()));
         }
         $startLine = $method->getStartLine() - 1;

153) /usr/src/myapp/src/Twig/SourceCodeExtension.php:72    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (false === ($classCode = file($method->getFileName()))) {
             throw new \LogicException(sprintf('There was an error while trying to read the contents of the "%s" file.', $method->getFileName()));
         }
-        $startLine = $method->getStartLine() - 1;
+        $startLine = $method->getStartLine() - 0;
         $endLine = $method->getEndLine();
         while ($startLine > 0) {
             $line = trim($classCode[$startLine - 1]);

154) /usr/src/myapp/src/Twig/SourceCodeExtension.php:72    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if (false === ($classCode = file($method->getFileName()))) {
             throw new \LogicException(sprintf('There was an error while trying to read the contents of the "%s" file.', $method->getFileName()));
         }
-        $startLine = $method->getStartLine() - 1;
+        $startLine = $method->getStartLine() - 2;
         $endLine = $method->getEndLine();
         while ($startLine > 0) {
             $line = trim($classCode[$startLine - 1]);

155) /usr/src/myapp/src/Twig/SourceCodeExtension.php:72    [M] Minus

--- Original
+++ New
@@ @@
         if (false === ($classCode = file($method->getFileName()))) {
             throw new \LogicException(sprintf('There was an error while trying to read the contents of the "%s" file.', $method->getFileName()));
         }
-        $startLine = $method->getStartLine() - 1;
+        $startLine = $method->getStartLine() + 1;
         $endLine = $method->getEndLine();
         while ($startLine > 0) {
             $line = trim($classCode[$startLine - 1]);

156) /usr/src/myapp/src/Twig/SourceCodeExtension.php:75    [M] GreaterThan

--- Original
+++ New
@@ @@
         }
         $startLine = $method->getStartLine() - 1;
         $endLine = $method->getEndLine();
-        while ($startLine > 0) {
+        while ($startLine >= 0) {
             $line = trim($classCode[$startLine - 1]);
             if (\in_array($line, ['{', '}', ''], true)) {
                 break;

157) /usr/src/myapp/src/Twig/SourceCodeExtension.php:75    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
         }
         $startLine = $method->getStartLine() - 1;
         $endLine = $method->getEndLine();
-        while ($startLine > 0) {
+        while ($startLine <= 0) {
             $line = trim($classCode[$startLine - 1]);
             if (\in_array($line, ['{', '}', ''], true)) {
                 break;

158) /usr/src/myapp/src/Twig/SourceCodeExtension.php:75    [M] While_

--- Original
+++ New
@@ @@
         }
         $startLine = $method->getStartLine() - 1;
         $endLine = $method->getEndLine();
-        while ($startLine > 0) {
+        while (false) {
             $line = trim($classCode[$startLine - 1]);
             if (\in_array($line, ['{', '}', ''], true)) {
                 break;

159) /usr/src/myapp/src/Twig/SourceCodeExtension.php:76    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $startLine = $method->getStartLine() - 1;
         $endLine = $method->getEndLine();
         while ($startLine > 0) {
-            $line = trim($classCode[$startLine - 1]);
+            $line = trim($classCode[$startLine - 0]);
             if (\in_array($line, ['{', '}', ''], true)) {
                 break;
             }

160) /usr/src/myapp/src/Twig/SourceCodeExtension.php:76    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $startLine = $method->getStartLine() - 1;
         $endLine = $method->getEndLine();
         while ($startLine > 0) {
-            $line = trim($classCode[$startLine - 1]);
+            $line = trim($classCode[$startLine - 2]);
             if (\in_array($line, ['{', '}', ''], true)) {
                 break;
             }

161) /usr/src/myapp/src/Twig/SourceCodeExtension.php:76    [M] Minus

--- Original
+++ New
@@ @@
         $startLine = $method->getStartLine() - 1;
         $endLine = $method->getEndLine();
         while ($startLine > 0) {
-            $line = trim($classCode[$startLine - 1]);
+            $line = trim($classCode[$startLine + 1]);
             if (\in_array($line, ['{', '}', ''], true)) {
                 break;
             }

162) /usr/src/myapp/src/Twig/SourceCodeExtension.php:76    [M] UnwrapTrim

--- Original
+++ New
@@ @@
         $startLine = $method->getStartLine() - 1;
         $endLine = $method->getEndLine();
         while ($startLine > 0) {
-            $line = trim($classCode[$startLine - 1]);
+            $line = $classCode[$startLine - 1];
             if (\in_array($line, ['{', '}', ''], true)) {
                 break;
             }

163) /usr/src/myapp/src/Twig/SourceCodeExtension.php:78    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $endLine = $method->getEndLine();
         while ($startLine > 0) {
             $line = trim($classCode[$startLine - 1]);
-            if (\in_array($line, ['{', '}', ''], true)) {
+            if (\in_array($line, ['}', ''], true)) {
                 break;
             }
             --$startLine;

164) /usr/src/myapp/src/Twig/SourceCodeExtension.php:82    [M] Decrement

--- Original
+++ New
@@ @@
             if (\in_array($line, ['{', '}', ''], true)) {
                 break;
             }
-            --$startLine;
+            ++$startLine;
         }
         $controllerCode = implode('', \array_slice($classCode, $startLine, $endLine - $startLine));
         return ['file_path' => $method->getFileName(), 'starting_line' => $method->getStartLine(), 'source_code' => $this->unindentCode($controllerCode)];

165) /usr/src/myapp/src/Twig/SourceCodeExtension.php:85    [M] Minus

--- Original
+++ New
@@ @@
             }
             --$startLine;
         }
-        $controllerCode = implode('', \array_slice($classCode, $startLine, $endLine - $startLine));
+        $controllerCode = implode('', \array_slice($classCode, $startLine, $endLine + $startLine));
         return ['file_path' => $method->getFileName(), 'starting_line' => $method->getStartLine(), 'source_code' => $this->unindentCode($controllerCode)];
     }
     /**

166) /usr/src/myapp/src/Twig/SourceCodeExtension.php:85    [M] UnwrapArraySlice

--- Original
+++ New
@@ @@
             }
             --$startLine;
         }
-        $controllerCode = implode('', \array_slice($classCode, $startLine, $endLine - $startLine));
+        $controllerCode = implode('', $classCode);
         return ['file_path' => $method->getFileName(), 'starting_line' => $method->getStartLine(), 'source_code' => $this->unindentCode($controllerCode)];
     }
     /**

167) /usr/src/myapp/src/Twig/SourceCodeExtension.php:124    [M] DecrementInteger

--- Original
+++ New
@@ @@
             // Demo app, we consider that all templates are stored in files and
             // that their file paths can be obtained through the source context.
             'file_path' => $templateSource->getPath(),
-            'starting_line' => 1,
+            'starting_line' => 0,
             'source_code' => $templateSource->getCode(),
         ];
     }

168) /usr/src/myapp/src/Twig/SourceCodeExtension.php:124    [M] IncrementInteger

--- Original
+++ New
@@ @@
             // Demo app, we consider that all templates are stored in files and
             // that their file paths can be obtained through the source context.
             'file_path' => $templateSource->getPath(),
-            'starting_line' => 1,
+            'starting_line' => 2,
             'source_code' => $templateSource->getCode(),
         ];
     }

169) /usr/src/myapp/src/Twig/SourceCodeExtension.php:137    [M] UnwrapArrayFilter

--- Original
+++ New
@@ @@
     private function unindentCode(string $code) : string
     {
         $codeLines = u($code)->split("\n");
-        $indentedOrBlankLines = array_filter($codeLines, static function ($lineOfCode) {
-            return u($lineOfCode)->isEmpty() || u($lineOfCode)->startsWith('    ');
-        });
+        $indentedOrBlankLines = $codeLines;
         $codeIsIndented = \count($indentedOrBlankLines) === \count($codeLines);
         if ($codeIsIndented) {
             $unindentedLines = array_map(static function ($lineOfCode) {

170) /usr/src/myapp/src/Twig/SourceCodeExtension.php:138    [M] LogicalOr

--- Original
+++ New
@@ @@
     {
         $codeLines = u($code)->split("\n");
         $indentedOrBlankLines = array_filter($codeLines, static function ($lineOfCode) {
-            return u($lineOfCode)->isEmpty() || u($lineOfCode)->startsWith('    ');
+            return u($lineOfCode)->isEmpty() && u($lineOfCode)->startsWith('    ');
         });
         $codeIsIndented = \count($indentedOrBlankLines) === \count($codeLines);
         if ($codeIsIndented) {

171) /usr/src/myapp/src/Twig/SourceCodeExtension.php:141    [M] Identical

--- Original
+++ New
@@ @@
         $indentedOrBlankLines = array_filter($codeLines, static function ($lineOfCode) {
             return u($lineOfCode)->isEmpty() || u($lineOfCode)->startsWith('    ');
         });
-        $codeIsIndented = \count($indentedOrBlankLines) === \count($codeLines);
+        $codeIsIndented = \count($indentedOrBlankLines) !== \count($codeLines);
         if ($codeIsIndented) {
             $unindentedLines = array_map(static function ($lineOfCode) {
                 return u($lineOfCode)->after('    ');

172) /usr/src/myapp/src/Twig/SourceCodeExtension.php:143    [M] UnwrapArrayMap

--- Original
+++ New
@@ @@
         });
         $codeIsIndented = \count($indentedOrBlankLines) === \count($codeLines);
         if ($codeIsIndented) {
-            $unindentedLines = array_map(static function ($lineOfCode) {
-                return u($lineOfCode)->after('    ');
-            }, $codeLines);
+            $unindentedLines = $codeLines;
             $code = u("\n")->join($unindentedLines)->toString();
         }
         return $code;
     }
 }

173) /usr/src/myapp/src/Utils/Validator.php:32    [M] PregMatchRemoveCaret

--- Original
+++ New
@@ @@
         if (empty($username)) {
             throw new InvalidArgumentException('The username can not be empty.');
         }
-        if (1 !== preg_match('/^[a-z_]+$/', $username)) {
+        if (1 !== preg_match('/[a-z_]+$/', $username)) {
             throw new InvalidArgumentException('The username must contain only lowercase latin characters and underscores.');
         }
         return $username;

174) /usr/src/myapp/src/Utils/Validator.php:32    [M] PregMatchRemoveDollar

--- Original
+++ New
@@ @@
         if (empty($username)) {
             throw new InvalidArgumentException('The username can not be empty.');
         }
-        if (1 !== preg_match('/^[a-z_]+$/', $username)) {
+        if (1 !== preg_match('/^[a-z_]+/', $username)) {
             throw new InvalidArgumentException('The username must contain only lowercase latin characters and underscores.');
         }
         return $username;


Timed Out mutants:
==================

1) /usr/src/myapp/src/Twig/SourceCodeExtension.php:79    [M] Break_

--- Original
+++ New
@@ @@
         while ($startLine > 0) {
             $line = trim($classCode[$startLine - 1]);
             if (\in_array($line, ['{', '}', ''], true)) {
-                break;
+                continue;
             }
             --$startLine;
         }

1) /usr/src/myapp/src/Command/AddUserCommand.php:125    [M] Concat

--- Original
+++ New
@@ @@
         // Ask for the username if it's not defined
         $username = $input->getArgument('username');
         if (null !== $username) {
-            $this->io->text(' > <info>Username</info>: ' . $username);
+            $this->io->text($username . ' > <info>Username</info>: ');
         } else {
             $username = $this->io->ask('Username', null, [$this->validator, 'validateUsername']);
             $input->setArgument('username', $username);

2) /usr/src/myapp/src/Command/AddUserCommand.php:125    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Ask for the username if it's not defined
         $username = $input->getArgument('username');
         if (null !== $username) {
-            $this->io->text(' > <info>Username</info>: ' . $username);
+            $this->io->text($username);
         } else {
             $username = $this->io->ask('Username', null, [$this->validator, 'validateUsername']);
             $input->setArgument('username', $username);

3) /usr/src/myapp/src/Command/AddUserCommand.php:125    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Ask for the username if it's not defined
         $username = $input->getArgument('username');
         if (null !== $username) {
-            $this->io->text(' > <info>Username</info>: ' . $username);
+            $this->io->text(' > <info>Username</info>: ');
         } else {
             $username = $this->io->ask('Username', null, [$this->validator, 'validateUsername']);
             $input->setArgument('username', $username);

4) /usr/src/myapp/src/Command/AddUserCommand.php:125    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // Ask for the username if it's not defined
         $username = $input->getArgument('username');
         if (null !== $username) {
-            $this->io->text(' > <info>Username</info>: ' . $username);
+            
         } else {
             $username = $this->io->ask('Username', null, [$this->validator, 'validateUsername']);
             $input->setArgument('username', $username);

5) /usr/src/myapp/src/Command/AddUserCommand.php:134    [M] Concat

--- Original
+++ New
@@ @@
         // Ask for the password if it's not defined
         $password = $input->getArgument('password');
         if (null !== $password) {
-            $this->io->text(' > <info>Password</info>: ' . u('*')->repeat(u($password)->length()));
+            $this->io->text(u('*')->repeat(u($password)->length()) . ' > <info>Password</info>: ');
         } else {
             $password = $this->io->askHidden('Password (your type will be hidden)', [$this->validator, 'validatePassword']);
             $input->setArgument('password', $password);

6) /usr/src/myapp/src/Command/AddUserCommand.php:134    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Ask for the password if it's not defined
         $password = $input->getArgument('password');
         if (null !== $password) {
-            $this->io->text(' > <info>Password</info>: ' . u('*')->repeat(u($password)->length()));
+            $this->io->text(u('*')->repeat(u($password)->length()));
         } else {
             $password = $this->io->askHidden('Password (your type will be hidden)', [$this->validator, 'validatePassword']);
             $input->setArgument('password', $password);

7) /usr/src/myapp/src/Command/AddUserCommand.php:134    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Ask for the password if it's not defined
         $password = $input->getArgument('password');
         if (null !== $password) {
-            $this->io->text(' > <info>Password</info>: ' . u('*')->repeat(u($password)->length()));
+            $this->io->text(' > <info>Password</info>: ');
         } else {
             $password = $this->io->askHidden('Password (your type will be hidden)', [$this->validator, 'validatePassword']);
             $input->setArgument('password', $password);

8) /usr/src/myapp/src/Command/AddUserCommand.php:134    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // Ask for the password if it's not defined
         $password = $input->getArgument('password');
         if (null !== $password) {
-            $this->io->text(' > <info>Password</info>: ' . u('*')->repeat(u($password)->length()));
+            
         } else {
             $password = $this->io->askHidden('Password (your type will be hidden)', [$this->validator, 'validatePassword']);
             $input->setArgument('password', $password);

9) /usr/src/myapp/src/Command/AddUserCommand.php:143    [M] Concat

--- Original
+++ New
@@ @@
         // Ask for the email if it's not defined
         $email = $input->getArgument('email');
         if (null !== $email) {
-            $this->io->text(' > <info>Email</info>: ' . $email);
+            $this->io->text($email . ' > <info>Email</info>: ');
         } else {
             $email = $this->io->ask('Email', null, [$this->validator, 'validateEmail']);
             $input->setArgument('email', $email);

10) /usr/src/myapp/src/Command/AddUserCommand.php:143    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Ask for the email if it's not defined
         $email = $input->getArgument('email');
         if (null !== $email) {
-            $this->io->text(' > <info>Email</info>: ' . $email);
+            $this->io->text($email);
         } else {
             $email = $this->io->ask('Email', null, [$this->validator, 'validateEmail']);
             $input->setArgument('email', $email);

11) /usr/src/myapp/src/Command/AddUserCommand.php:143    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Ask for the email if it's not defined
         $email = $input->getArgument('email');
         if (null !== $email) {
-            $this->io->text(' > <info>Email</info>: ' . $email);
+            $this->io->text(' > <info>Email</info>: ');
         } else {
             $email = $this->io->ask('Email', null, [$this->validator, 'validateEmail']);
             $input->setArgument('email', $email);

12) /usr/src/myapp/src/Command/AddUserCommand.php:143    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // Ask for the email if it's not defined
         $email = $input->getArgument('email');
         if (null !== $email) {
-            $this->io->text(' > <info>Email</info>: ' . $email);
+            
         } else {
             $email = $this->io->ask('Email', null, [$this->validator, 'validateEmail']);
             $input->setArgument('email', $email);

13) /usr/src/myapp/src/Command/AddUserCommand.php:152    [M] Concat

--- Original
+++ New
@@ @@
         // Ask for the full name if it's not defined
         $fullName = $input->getArgument('full-name');
         if (null !== $fullName) {
-            $this->io->text(' > <info>Full Name</info>: ' . $fullName);
+            $this->io->text($fullName . ' > <info>Full Name</info>: ');
         } else {
             $fullName = $this->io->ask('Full Name', null, [$this->validator, 'validateFullName']);
             $input->setArgument('full-name', $fullName);

14) /usr/src/myapp/src/Command/AddUserCommand.php:152    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Ask for the full name if it's not defined
         $fullName = $input->getArgument('full-name');
         if (null !== $fullName) {
-            $this->io->text(' > <info>Full Name</info>: ' . $fullName);
+            $this->io->text($fullName);
         } else {
             $fullName = $this->io->ask('Full Name', null, [$this->validator, 'validateFullName']);
             $input->setArgument('full-name', $fullName);

15) /usr/src/myapp/src/Command/AddUserCommand.php:152    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Ask for the full name if it's not defined
         $fullName = $input->getArgument('full-name');
         if (null !== $fullName) {
-            $this->io->text(' > <info>Full Name</info>: ' . $fullName);
+            $this->io->text(' > <info>Full Name</info>: ');
         } else {
             $fullName = $this->io->ask('Full Name', null, [$this->validator, 'validateFullName']);
             $input->setArgument('full-name', $fullName);

16) /usr/src/myapp/src/Command/AddUserCommand.php:152    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // Ask for the full name if it's not defined
         $fullName = $input->getArgument('full-name');
         if (null !== $fullName) {
-            $this->io->text(' > <info>Full Name</info>: ' . $fullName);
+            
         } else {
             $fullName = $this->io->ask('Full Name', null, [$this->validator, 'validateFullName']);
             $input->setArgument('full-name', $fullName);

17) /usr/src/myapp/src/Command/AddUserCommand.php:195    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $this->io->success(sprintf('%s was successfully created: %s (%s)', $isAdmin ? 'Administrator user' : 'User', $user->getUsername(), $user->getEmail()));
         $event = $stopwatch->stop('add-user-command');
         if ($output->isVerbose()) {
-            $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() / 1024 ** 2));
+            $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() / 1023 ** 2));
         }
         return Command::SUCCESS;
     }

18) /usr/src/myapp/src/Command/AddUserCommand.php:195    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $this->io->success(sprintf('%s was successfully created: %s (%s)', $isAdmin ? 'Administrator user' : 'User', $user->getUsername(), $user->getEmail()));
         $event = $stopwatch->stop('add-user-command');
         if ($output->isVerbose()) {
-            $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() / 1024 ** 2));
+            $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() / 1025 ** 2));
         }
         return Command::SUCCESS;
     }

19) /usr/src/myapp/src/Command/AddUserCommand.php:195    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $this->io->success(sprintf('%s was successfully created: %s (%s)', $isAdmin ? 'Administrator user' : 'User', $user->getUsername(), $user->getEmail()));
         $event = $stopwatch->stop('add-user-command');
         if ($output->isVerbose()) {
-            $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() / 1024 ** 2));
+            $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() / 1024 ** 1));
         }
         return Command::SUCCESS;
     }

20) /usr/src/myapp/src/Command/AddUserCommand.php:195    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $this->io->success(sprintf('%s was successfully created: %s (%s)', $isAdmin ? 'Administrator user' : 'User', $user->getUsername(), $user->getEmail()));
         $event = $stopwatch->stop('add-user-command');
         if ($output->isVerbose()) {
-            $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() / 1024 ** 2));
+            $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() / 1024 ** 3));
         }
         return Command::SUCCESS;
     }

21) /usr/src/myapp/src/Command/AddUserCommand.php:195    [M] Exponentiation

--- Original
+++ New
@@ @@
         $this->io->success(sprintf('%s was successfully created: %s (%s)', $isAdmin ? 'Administrator user' : 'User', $user->getUsername(), $user->getEmail()));
         $event = $stopwatch->stop('add-user-command');
         if ($output->isVerbose()) {
-            $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() / 1024 ** 2));
+            $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() / (1024 / 2)));
         }
         return Command::SUCCESS;
     }

22) /usr/src/myapp/src/Command/AddUserCommand.php:195    [M] Division

--- Original
+++ New
@@ @@
         $this->io->success(sprintf('%s was successfully created: %s (%s)', $isAdmin ? 'Administrator user' : 'User', $user->getUsername(), $user->getEmail()));
         $event = $stopwatch->stop('add-user-command');
         if ($output->isVerbose()) {
-            $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() / 1024 ** 2));
+            $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() * 1024 ** 2));
         }
         return Command::SUCCESS;
     }

23) /usr/src/myapp/src/Command/AddUserCommand.php:195    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->io->success(sprintf('%s was successfully created: %s (%s)', $isAdmin ? 'Administrator user' : 'User', $user->getUsername(), $user->getEmail()));
         $event = $stopwatch->stop('add-user-command');
         if ($output->isVerbose()) {
-            $this->io->comment(sprintf('New user database id: %d / Elapsed time: %.2f ms / Consumed memory: %.2f MB', $user->getId(), $event->getDuration(), $event->getMemory() / 1024 ** 2));
+            
         }
         return Command::SUCCESS;
     }

24) /usr/src/myapp/src/Command/AddUserCommand.php:207    [M] Throw_

--- Original
+++ New
@@ @@
         // first check if a user with the same username already exists.
         $existingUser = $this->users->findOneBy(['username' => $username]);
         if (null !== $existingUser) {
-            throw new RuntimeException(sprintf('There is already a user registered with the "%s" username.', $username));
+            new RuntimeException(sprintf('There is already a user registered with the "%s" username.', $username));
         }
         // validate password and email if is not this input means interactive.
         $this->validator->validatePassword($plainPassword);

25) /usr/src/myapp/src/Command/AddUserCommand.php:219    [M] Throw_

--- Original
+++ New
@@ @@
         // check if a user with the same email already exists.
         $existingEmail = $this->users->findOneBy(['email' => $email]);
         if (null !== $existingEmail) {
-            throw new RuntimeException(sprintf('There is already a user registered with the "%s" email.', $email));
+            new RuntimeException(sprintf('There is already a user registered with the "%s" email.', $email));
         }
     }
     /**

27) /usr/src/myapp/src/Command/DeleteUserCommand.php:64    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     protected function configure() : void
     {
-        $this->addArgument('username', InputArgument::REQUIRED, 'The username of an existing user')->setHelp(<<<'HELP'
-The <info>%command.name%</info> command deletes users from the database:
-
-  <info>php %command.full_name%</info> <comment>username</comment>
-
-If you omit the argument, the command will ask you to
-provide the missing value:
-
-  <info>php %command.full_name%</info>
-HELP
-);
+        
     }
     protected function initialize(InputInterface $input, OutputInterface $output) : void
     {
