28) /usr/src/myapp/src/Command/DeleteUserCommand.php:89    [M] NotIdentical

--- Original
+++ New
@@ @@
     }
     protected function interact(InputInterface $input, OutputInterface $output) : void
     {
-        if (null !== $input->getArgument('username')) {
+        if (null === $input->getArgument('username')) {
             return;
         }
         $this->io->title('Delete User Command Interactive Wizard');

29) /usr/src/myapp/src/Command/DeleteUserCommand.php:93    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (null !== $input->getArgument('username')) {
             return;
         }
-        $this->io->title('Delete User Command Interactive Wizard');
+        
         $this->io->text(['If you prefer to not use this interactive wizard, provide the', 'arguments required by this command as follows:', '', ' $ php bin/console app:delete-user username', '', 'Now we\'ll ask you for the value of all the missing command arguments.', '']);
         $username = $this->io->ask('Username', null, [$this->validator, 'validateUsername']);
         $input->setArgument('username', $username);

30) /usr/src/myapp/src/Command/DeleteUserCommand.php:94    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             return;
         }
         $this->io->title('Delete User Command Interactive Wizard');
-        $this->io->text(['If you prefer to not use this interactive wizard, provide the', 'arguments required by this command as follows:', '', ' $ php bin/console app:delete-user username', '', 'Now we\'ll ask you for the value of all the missing command arguments.', '']);
+        $this->io->text(['arguments required by this command as follows:', '', ' $ php bin/console app:delete-user username', '', 'Now we\'ll ask you for the value of all the missing command arguments.', '']);
         $username = $this->io->ask('Username', null, [$this->validator, 'validateUsername']);
         $input->setArgument('username', $username);
     }

31) /usr/src/myapp/src/Command/DeleteUserCommand.php:94    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return;
         }
         $this->io->title('Delete User Command Interactive Wizard');
-        $this->io->text(['If you prefer to not use this interactive wizard, provide the', 'arguments required by this command as follows:', '', ' $ php bin/console app:delete-user username', '', 'Now we\'ll ask you for the value of all the missing command arguments.', '']);
+        
         $username = $this->io->ask('Username', null, [$this->validator, 'validateUsername']);
         $input->setArgument('username', $username);
     }

32) /usr/src/myapp/src/Command/DeleteUserCommand.php:104    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $this->io->title('Delete User Command Interactive Wizard');
         $this->io->text(['If you prefer to not use this interactive wizard, provide the', 'arguments required by this command as follows:', '', ' $ php bin/console app:delete-user username', '', 'Now we\'ll ask you for the value of all the missing command arguments.', '']);
-        $username = $this->io->ask('Username', null, [$this->validator, 'validateUsername']);
+        $username = $this->io->ask('Username', null, ['validateUsername']);
         $input->setArgument('username', $username);
     }
     protected function execute(InputInterface $input, OutputInterface $output) : int

33) /usr/src/myapp/src/Command/DeleteUserCommand.php:105    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->io->title('Delete User Command Interactive Wizard');
         $this->io->text(['If you prefer to not use this interactive wizard, provide the', 'arguments required by this command as follows:', '', ' $ php bin/console app:delete-user username', '', 'Now we\'ll ask you for the value of all the missing command arguments.', '']);
         $username = $this->io->ask('Username', null, [$this->validator, 'validateUsername']);
-        $input->setArgument('username', $username);
+        
     }
     protected function execute(InputInterface $input, OutputInterface $output) : int
     {

34) /usr/src/myapp/src/Command/DeleteUserCommand.php:115    [M] Identical

--- Original
+++ New
@@ @@
         $username = $this->validator->validateUsername($input->getArgument('username'));
         /** @var User|null $user */
         $user = $this->users->findOneByUsername($username);
-        if (null === $user) {
+        if (null !== $user) {
             throw new RuntimeException(sprintf('User with username "%s" not found.', $username));
         }
         // After an entity has been removed, its in-memory state is the same

35) /usr/src/myapp/src/Command/DeleteUserCommand.php:116    [M] Throw_

--- Original
+++ New
@@ @@
         /** @var User|null $user */
         $user = $this->users->findOneByUsername($username);
         if (null === $user) {
-            throw new RuntimeException(sprintf('User with username "%s" not found.', $username));
+            new RuntimeException(sprintf('User with username "%s" not found.', $username));
         }
         // After an entity has been removed, its in-memory state is the same
         // as before the removal, except for generated identifiers.

36) /usr/src/myapp/src/Command/DeleteUserCommand.php:124    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // as before the removal, except for generated identifiers.
         // See https://www.doctrine-project.org/projects/doctrine-orm/en/latest/reference/working-with-objects.html#removing-entities
         $userId = $user->getId();
-        $this->entityManager->remove($user);
+        
         $this->entityManager->flush();
         $userUsername = $user->getUsername();
         $userEmail = $user->getEmail();

37) /usr/src/myapp/src/Command/DeleteUserCommand.php:125    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // See https://www.doctrine-project.org/projects/doctrine-orm/en/latest/reference/working-with-objects.html#removing-entities
         $userId = $user->getId();
         $this->entityManager->remove($user);
-        $this->entityManager->flush();
+        
         $userUsername = $user->getUsername();
         $userEmail = $user->getEmail();
         $this->io->success(sprintf('User "%s" (ID: %d, email: %s) was successfully deleted.', $userUsername, $userId, $userEmail));

38) /usr/src/myapp/src/Command/DeleteUserCommand.php:130    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->entityManager->flush();
         $userUsername = $user->getUsername();
         $userEmail = $user->getEmail();
-        $this->io->success(sprintf('User "%s" (ID: %d, email: %s) was successfully deleted.', $userUsername, $userId, $userEmail));
+        
         // Logging is helpful and important to keep a trace of what happened in the software runtime flow.
         // See https://symfony.com/doc/current/logging.html
         $this->logger->info('User "{username}" (ID: {id}, email: {email}) was successfully deleted.', ['username' => $userUsername, 'id' => $userId, 'email' => $userEmail]);

39) /usr/src/myapp/src/Command/DeleteUserCommand.php:134    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $this->io->success(sprintf('User "%s" (ID: %d, email: %s) was successfully deleted.', $userUsername, $userId, $userEmail));
         // Logging is helpful and important to keep a trace of what happened in the software runtime flow.
         // See https://symfony.com/doc/current/logging.html
-        $this->logger->info('User "{username}" (ID: {id}, email: {email}) was successfully deleted.', ['username' => $userUsername, 'id' => $userId, 'email' => $userEmail]);
+        $this->logger->info('User "{username}" (ID: {id}, email: {email}) was successfully deleted.', ['id' => $userId, 'email' => $userEmail]);
         return Command::SUCCESS;
     }
 }

40) /usr/src/myapp/src/Command/DeleteUserCommand.php:134    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $userUsername = $user->getUsername();
         $userEmail = $user->getEmail();
         $this->io->success(sprintf('User "%s" (ID: %d, email: %s) was successfully deleted.', $userUsername, $userId, $userEmail));
-        // Logging is helpful and important to keep a trace of what happened in the software runtime flow.
-        // See https://symfony.com/doc/current/logging.html
-        $this->logger->info('User "{username}" (ID: {id}, email: {email}) was successfully deleted.', ['username' => $userUsername, 'id' => $userId, 'email' => $userEmail]);
+        
         return Command::SUCCESS;
     }
 }

47) /usr/src/myapp/src/Controller/BlogController.php:45    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      *
      * See https://symfony.com/doc/current/routing.html#special-parameters
      */
-    #[Route('/', defaults: ['page' => '1', '_format' => 'html'], methods: ['GET'], name: 'blog_index')]
+    #[Route('/', defaults: ['_format' => 'html'], methods: ['GET'], name: 'blog_index')]
     #[Route('/rss.xml', defaults: ['page' => '1', '_format' => 'xml'], methods: ['GET'], name: 'blog_rss')]
     #[Route('/page/{page<[1-9]\\d*>}', defaults: ['_format' => 'html'], methods: ['GET'], name: 'blog_index_paginated')]
     #[Cache(smaxage: 10)]

48) /usr/src/myapp/src/Controller/BlogController.php:45    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      *
      * See https://symfony.com/doc/current/routing.html#special-parameters
      */
-    #[Route('/', defaults: ['page' => '1', '_format' => 'html'], methods: ['GET'], name: 'blog_index')]
+    #[Route('/', defaults: ['page' => '1', '_format' => 'html'], methods: [], name: 'blog_index')]
     #[Route('/rss.xml', defaults: ['page' => '1', '_format' => 'xml'], methods: ['GET'], name: 'blog_rss')]
     #[Route('/page/{page<[1-9]\\d*>}', defaults: ['_format' => 'html'], methods: ['GET'], name: 'blog_index_paginated')]
     #[Cache(smaxage: 10)]

49) /usr/src/myapp/src/Controller/BlogController.php:46    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      * See https://symfony.com/doc/current/routing.html#special-parameters
      */
     #[Route('/', defaults: ['page' => '1', '_format' => 'html'], methods: ['GET'], name: 'blog_index')]
-    #[Route('/rss.xml', defaults: ['page' => '1', '_format' => 'xml'], methods: ['GET'], name: 'blog_rss')]
+    #[Route('/rss.xml', defaults: ['_format' => 'xml'], methods: ['GET'], name: 'blog_rss')]
     #[Route('/page/{page<[1-9]\\d*>}', defaults: ['_format' => 'html'], methods: ['GET'], name: 'blog_index_paginated')]
     #[Cache(smaxage: 10)]
     public function index(Request $request, int $page, string $_format, PostRepository $posts, TagRepository $tags) : Response

50) /usr/src/myapp/src/Controller/BlogController.php:46    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      * See https://symfony.com/doc/current/routing.html#special-parameters
      */
     #[Route('/', defaults: ['page' => '1', '_format' => 'html'], methods: ['GET'], name: 'blog_index')]
-    #[Route('/rss.xml', defaults: ['page' => '1', '_format' => 'xml'], methods: ['GET'], name: 'blog_rss')]
+    #[Route('/rss.xml', defaults: ['page' => '1', '_format' => 'xml'], methods: [], name: 'blog_rss')]
     #[Route('/page/{page<[1-9]\\d*>}', defaults: ['_format' => 'html'], methods: ['GET'], name: 'blog_index_paginated')]
     #[Cache(smaxage: 10)]
     public function index(Request $request, int $page, string $_format, PostRepository $posts, TagRepository $tags) : Response

51) /usr/src/myapp/src/Controller/BlogController.php:47    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     #[Route('/', defaults: ['page' => '1', '_format' => 'html'], methods: ['GET'], name: 'blog_index')]
     #[Route('/rss.xml', defaults: ['page' => '1', '_format' => 'xml'], methods: ['GET'], name: 'blog_rss')]
-    #[Route('/page/{page<[1-9]\\d*>}', defaults: ['_format' => 'html'], methods: ['GET'], name: 'blog_index_paginated')]
+    #[Route('/page/{page<[1-9]\\d*>}', defaults: [], methods: ['GET'], name: 'blog_index_paginated')]
     #[Cache(smaxage: 10)]
     public function index(Request $request, int $page, string $_format, PostRepository $posts, TagRepository $tags) : Response
     {

52) /usr/src/myapp/src/Controller/BlogController.php:47    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     #[Route('/', defaults: ['page' => '1', '_format' => 'html'], methods: ['GET'], name: 'blog_index')]
     #[Route('/rss.xml', defaults: ['page' => '1', '_format' => 'xml'], methods: ['GET'], name: 'blog_rss')]
-    #[Route('/page/{page<[1-9]\\d*>}', defaults: ['_format' => 'html'], methods: ['GET'], name: 'blog_index_paginated')]
+    #[Route('/page/{page<[1-9]\\d*>}', defaults: ['_format' => 'html'], methods: [], name: 'blog_index_paginated')]
     #[Cache(smaxage: 10)]
     public function index(Request $request, int $page, string $_format, PostRepository $posts, TagRepository $tags) : Response
     {

53) /usr/src/myapp/src/Controller/BlogController.php:48    [M] DecrementInteger

--- Original
+++ New
@@ @@
     #[Route('/', defaults: ['page' => '1', '_format' => 'html'], methods: ['GET'], name: 'blog_index')]
     #[Route('/rss.xml', defaults: ['page' => '1', '_format' => 'xml'], methods: ['GET'], name: 'blog_rss')]
     #[Route('/page/{page<[1-9]\\d*>}', defaults: ['_format' => 'html'], methods: ['GET'], name: 'blog_index_paginated')]
-    #[Cache(smaxage: 10)]
+    #[Cache(smaxage: 9)]
     public function index(Request $request, int $page, string $_format, PostRepository $posts, TagRepository $tags) : Response
     {
         $tag = null;

54) /usr/src/myapp/src/Controller/BlogController.php:48    [M] IncrementInteger

--- Original
+++ New
@@ @@
     #[Route('/', defaults: ['page' => '1', '_format' => 'html'], methods: ['GET'], name: 'blog_index')]
     #[Route('/rss.xml', defaults: ['page' => '1', '_format' => 'xml'], methods: ['GET'], name: 'blog_rss')]
     #[Route('/page/{page<[1-9]\\d*>}', defaults: ['_format' => 'html'], methods: ['GET'], name: 'blog_index_paginated')]
-    #[Cache(smaxage: 10)]
+    #[Cache(smaxage: 11)]
     public function index(Request $request, int $page, string $_format, PostRepository $posts, TagRepository $tags) : Response
     {
         $tag = null;

55) /usr/src/myapp/src/Controller/BlogController.php:53    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $tag = null;
         if ($request->query->has('tag')) {
-            $tag = $tags->findOneBy(['name' => $request->query->get('tag')]);
+            $tag = $tags->findOneBy(['name' > $request->query->get('tag')]);
         }
         $latestPosts = $posts->findLatest($page, $tag);
         // Every template name also has two extensions that specify the format and

56) /usr/src/myapp/src/Controller/BlogController.php:53    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $tag = null;
         if ($request->query->has('tag')) {
-            $tag = $tags->findOneBy(['name' => $request->query->get('tag')]);
+            $tag = $tags->findOneBy([]);
         }
         $latestPosts = $posts->findLatest($page, $tag);
         // Every template name also has two extensions that specify the format and

57) /usr/src/myapp/src/Controller/BlogController.php:73    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      *
      * See https://symfony.com/doc/current/bundles/SensioFrameworkExtraBundle/annotations/converters.html
      */
-    #[Route('/posts/{slug}', methods: ['GET'], name: 'blog_post')]
+    #[Route('/posts/{slug}', methods: [], name: 'blog_post')]
     public function postShow(Post $post) : Response
     {
         // Symfony's 'dump()' function is an improved version of PHP's 'var_dump()' but

58) /usr/src/myapp/src/Controller/BlogController.php:99    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      *
      * See https://symfony.com/doc/current/bundles/SensioFrameworkExtraBundle/annotations/converters.html#doctrine-converter
      */
-    #[Route('/comment/{postSlug}/new', methods: ['POST'], name: 'comment_new')]
+    #[Route('/comment/{postSlug}/new', methods: [], name: 'comment_new')]
     #[IsGranted('IS_AUTHENTICATED_FULLY')]
     #[ParamConverter('post', options: ['mapping' => ['postSlug' => 'slug']])]
     public function commentNew(Request $request, Post $post, EventDispatcherInterface $eventDispatcher, EntityManagerInterface $entityManager) : Response

59) /usr/src/myapp/src/Controller/BlogController.php:101    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     #[Route('/comment/{postSlug}/new', methods: ['POST'], name: 'comment_new')]
     #[IsGranted('IS_AUTHENTICATED_FULLY')]
-    #[ParamConverter('post', options: ['mapping' => ['postSlug' => 'slug']])]
+    #[ParamConverter('post', options: ['mapping' => []])]
     public function commentNew(Request $request, Post $post, EventDispatcherInterface $eventDispatcher, EntityManagerInterface $entityManager) : Response
     {
         $comment = new Comment();

60) /usr/src/myapp/src/Controller/BlogController.php:101    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     #[Route('/comment/{postSlug}/new', methods: ['POST'], name: 'comment_new')]
     #[IsGranted('IS_AUTHENTICATED_FULLY')]
-    #[ParamConverter('post', options: ['mapping' => ['postSlug' => 'slug']])]
+    #[ParamConverter('post', options: [])]
     public function commentNew(Request $request, Post $post, EventDispatcherInterface $eventDispatcher, EntityManagerInterface $entityManager) : Response
     {
         $comment = new Comment();

61) /usr/src/myapp/src/Controller/BlogController.php:125    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $eventDispatcher->dispatch(new CommentCreatedEvent($comment));
             return $this->redirectToRoute('blog_post', ['slug' => $post->getSlug()]);
         }
-        return $this->render('blog/comment_form_error.html.twig', ['post' => $post, 'form' => $form->createView()]);
+        return $this->render('blog/comment_form_error.html.twig', ['form' => $form->createView()]);
     }
     /**
      * This controller is called directly via the render() function in the

62) /usr/src/myapp/src/Controller/BlogController.php:127    [M] ArrayItem

--- Original
+++ New
@@ @@
             $eventDispatcher->dispatch(new CommentCreatedEvent($comment));
             return $this->redirectToRoute('blog_post', ['slug' => $post->getSlug()]);
         }
-        return $this->render('blog/comment_form_error.html.twig', ['post' => $post, 'form' => $form->createView()]);
+        return $this->render('blog/comment_form_error.html.twig', ['post' => $post, 'form' > $form->createView()]);
     }
     /**
      * This controller is called directly via the render() function in the

63) /usr/src/myapp/src/Controller/BlogController.php:149    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $form = $this->createForm(CommentType::class);
         return $this->render('blog/_comment_form.html.twig', ['post' => $post, 'form' => $form->createView()]);
     }
-    #[Route('/search', methods: ['GET'], name: 'blog_search')]
+    #[Route('/search', methods: [], name: 'blog_search')]
     public function search(Request $request, PostRepository $posts) : Response
     {
         $query = $request->query->get('q', '');

64) /usr/src/myapp/src/Controller/BlogController.php:156    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $query = $request->query->get('q', '');
         $limit = $request->query->get('l', 10);
         if (!$request->isXmlHttpRequest()) {
-            return $this->render('blog/search.html.twig', ['query' => $query]);
+            return $this->render('blog/search.html.twig', []);
         }
         $foundPosts = $posts->findBySearchQuery($query, $limit);
         $results = [];

67) /usr/src/myapp/src/Controller/UserController.php:32    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 #[Route('/profile'), IsGranted('ROLE_USER')]
 class UserController extends AbstractController
 {
-    #[Route('/edit', methods: ['GET', 'POST'], name: 'user_edit')]
+    #[Route('/edit', methods: ['POST'], name: 'user_edit')]
     public function edit(Request $request, EntityManagerInterface $entityManager) : Response
     {
         $user = $this->getUser();

68) /usr/src/myapp/src/Controller/UserController.php:54    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         return $this->render('user/edit.html.twig', ['user' => $user, 'form' => $form->createView()]);
     }
-    #[Route('/change-password', methods: ['GET', 'POST'], name: 'user_change_password')]
+    #[Route('/change-password', methods: ['POST'], name: 'user_change_password')]
     public function changePassword(Request $request, UserPasswordHasherInterface $passwordHasher, EntityManagerInterface $entityManager) : Response
     {
         $user = $this->getUser();

69) /usr/src/myapp/src/DataFixtures/AppFixtures.php:34    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function load(ObjectManager $manager) : void
     {
-        $this->loadUsers($manager);
+        
         $this->loadTags($manager);
         $this->loadPosts($manager);
     }

70) /usr/src/myapp/src/DataFixtures/AppFixtures.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function load(ObjectManager $manager) : void
     {
         $this->loadUsers($manager);
-        $this->loadTags($manager);
+        
         $this->loadPosts($manager);
     }
     private function loadUsers(ObjectManager $manager) : void

71) /usr/src/myapp/src/DataFixtures/AppFixtures.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->loadUsers($manager);
         $this->loadTags($manager);
-        $this->loadPosts($manager);
+        
     }
     private function loadUsers(ObjectManager $manager) : void
     {

72) /usr/src/myapp/src/DataFixtures/AppFixtures.php:41    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     private function loadUsers(ObjectManager $manager) : void
     {
-        foreach ($this->getUserData() as [$fullname, $username, $password, $email, $roles]) {
+        foreach ($this->getUserData() as [$username, $password, $email, $roles]) {
             $user = new User();
             $user->setFullName($fullname);
             $user->setUsername($username);

73) /usr/src/myapp/src/DataFixtures/AppFixtures.php:41    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     private function loadUsers(ObjectManager $manager) : void
     {
-        foreach ($this->getUserData() as [$fullname, $username, $password, $email, $roles]) {
+        foreach (array() as [$fullname, $username, $password, $email, $roles]) {
             $user = new User();
             $user->setFullName($fullname);
             $user->setUsername($username);

74) /usr/src/myapp/src/DataFixtures/AppFixtures.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         foreach ($this->getUserData() as [$fullname, $username, $password, $email, $roles]) {
             $user = new User();
-            $user->setFullName($fullname);
+            
             $user->setUsername($username);
             $user->setPassword($this->passwordHasher->hashPassword($user, $password));
             $user->setEmail($email);

75) /usr/src/myapp/src/DataFixtures/AppFixtures.php:44    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         foreach ($this->getUserData() as [$fullname, $username, $password, $email, $roles]) {
             $user = new User();
             $user->setFullName($fullname);
-            $user->setUsername($username);
+            
             $user->setPassword($this->passwordHasher->hashPassword($user, $password));
             $user->setEmail($email);
             $user->setRoles($roles);

76) /usr/src/myapp/src/DataFixtures/AppFixtures.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $user = new User();
             $user->setFullName($fullname);
             $user->setUsername($username);
-            $user->setPassword($this->passwordHasher->hashPassword($user, $password));
+            
             $user->setEmail($email);
             $user->setRoles($roles);
             $manager->persist($user);

77) /usr/src/myapp/src/DataFixtures/AppFixtures.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $user->setFullName($fullname);
             $user->setUsername($username);
             $user->setPassword($this->passwordHasher->hashPassword($user, $password));
-            $user->setEmail($email);
+            
             $user->setRoles($roles);
             $manager->persist($user);
             $this->addReference($username, $user);

78) /usr/src/myapp/src/DataFixtures/AppFixtures.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $user->setUsername($username);
             $user->setPassword($this->passwordHasher->hashPassword($user, $password));
             $user->setEmail($email);
-            $user->setRoles($roles);
+            
             $manager->persist($user);
             $this->addReference($username, $user);
         }

79) /usr/src/myapp/src/DataFixtures/AppFixtures.php:49    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $user->setPassword($this->passwordHasher->hashPassword($user, $password));
             $user->setEmail($email);
             $user->setRoles($roles);
-            $manager->persist($user);
+            
             $this->addReference($username, $user);
         }
         $manager->flush();

80) /usr/src/myapp/src/DataFixtures/AppFixtures.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $user->setEmail($email);
             $user->setRoles($roles);
             $manager->persist($user);
-            $this->addReference($username, $user);
+            
         }
         $manager->flush();
     }

81) /usr/src/myapp/src/DataFixtures/AppFixtures.php:53    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $manager->persist($user);
             $this->addReference($username, $user);
         }
-        $manager->flush();
+        
     }
     private function loadTags(ObjectManager $manager) : void
     {

82) /usr/src/myapp/src/DataFixtures/AppFixtures.php:58    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     private function loadTags(ObjectManager $manager) : void
     {
-        foreach ($this->getTagData() as $name) {
+        foreach (array() as $name) {
             $tag = new Tag();
             $tag->setName($name);
             $manager->persist($tag);

83) /usr/src/myapp/src/DataFixtures/AppFixtures.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         foreach ($this->getTagData() as $name) {
             $tag = new Tag();
-            $tag->setName($name);
+            
             $manager->persist($tag);
             $this->addReference('tag-' . $name, $tag);
         }

84) /usr/src/myapp/src/DataFixtures/AppFixtures.php:62    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         foreach ($this->getTagData() as $name) {
             $tag = new Tag();
             $tag->setName($name);
-            $manager->persist($tag);
+            
             $this->addReference('tag-' . $name, $tag);
         }
         $manager->flush();

85) /usr/src/myapp/src/DataFixtures/AppFixtures.php:63    [M] Concat

--- Original
+++ New
@@ @@
             $tag = new Tag();
             $tag->setName($name);
             $manager->persist($tag);
-            $this->addReference('tag-' . $name, $tag);
+            $this->addReference($name . 'tag-', $tag);
         }
         $manager->flush();
     }

86) /usr/src/myapp/src/DataFixtures/AppFixtures.php:63    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $tag = new Tag();
             $tag->setName($name);
             $manager->persist($tag);
-            $this->addReference('tag-' . $name, $tag);
+            $this->addReference($name, $tag);
         }
         $manager->flush();
     }

87) /usr/src/myapp/src/DataFixtures/AppFixtures.php:63    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $tag = new Tag();
             $tag->setName($name);
             $manager->persist($tag);
-            $this->addReference('tag-' . $name, $tag);
+            $this->addReference('tag-', $tag);
         }
         $manager->flush();
     }

88) /usr/src/myapp/src/DataFixtures/AppFixtures.php:63    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $tag = new Tag();
             $tag->setName($name);
             $manager->persist($tag);
-            $this->addReference('tag-' . $name, $tag);
+            
         }
         $manager->flush();
     }

90) /usr/src/myapp/src/DataFixtures/AppFixtures.php:71    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     private function loadPosts(ObjectManager $manager) : void
     {
-        foreach ($this->getPostData() as [$title, $slug, $summary, $content, $publishedAt, $author, $tags]) {
+        foreach ($this->getPostData() as [$slug, $summary, $content, $publishedAt, $author, $tags]) {
             $post = new Post();
             $post->setTitle($title);
             $post->setSlug($slug);

91) /usr/src/myapp/src/DataFixtures/AppFixtures.php:71    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     private function loadPosts(ObjectManager $manager) : void
     {
-        foreach ($this->getPostData() as [$title, $slug, $summary, $content, $publishedAt, $author, $tags]) {
+        foreach (array() as [$title, $slug, $summary, $content, $publishedAt, $author, $tags]) {
             $post = new Post();
             $post->setTitle($title);
             $post->setSlug($slug);
