92) /usr/src/myapp/src/DataFixtures/AppFixtures.php:73    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         foreach ($this->getPostData() as [$title, $slug, $summary, $content, $publishedAt, $author, $tags]) {
             $post = new Post();
-            $post->setTitle($title);
+            
             $post->setSlug($slug);
             $post->setSummary($summary);
             $post->setContent($content);

93) /usr/src/myapp/src/DataFixtures/AppFixtures.php:74    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         foreach ($this->getPostData() as [$title, $slug, $summary, $content, $publishedAt, $author, $tags]) {
             $post = new Post();
             $post->setTitle($title);
-            $post->setSlug($slug);
+            
             $post->setSummary($summary);
             $post->setContent($content);
             $post->setPublishedAt($publishedAt);

94) /usr/src/myapp/src/DataFixtures/AppFixtures.php:75    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $post = new Post();
             $post->setTitle($title);
             $post->setSlug($slug);
-            $post->setSummary($summary);
+            
             $post->setContent($content);
             $post->setPublishedAt($publishedAt);
             $post->setAuthor($author);

95) /usr/src/myapp/src/DataFixtures/AppFixtures.php:76    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $post->setTitle($title);
             $post->setSlug($slug);
             $post->setSummary($summary);
-            $post->setContent($content);
+            
             $post->setPublishedAt($publishedAt);
             $post->setAuthor($author);
             $post->addTag(...$tags);

96) /usr/src/myapp/src/DataFixtures/AppFixtures.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $post->setSlug($slug);
             $post->setSummary($summary);
             $post->setContent($content);
-            $post->setPublishedAt($publishedAt);
+            
             $post->setAuthor($author);
             $post->addTag(...$tags);
             foreach (range(1, 5) as $i) {

97) /usr/src/myapp/src/DataFixtures/AppFixtures.php:78    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $post->setSummary($summary);
             $post->setContent($content);
             $post->setPublishedAt($publishedAt);
-            $post->setAuthor($author);
+            
             $post->addTag(...$tags);
             foreach (range(1, 5) as $i) {
                 $comment = new Comment();

98) /usr/src/myapp/src/DataFixtures/AppFixtures.php:79    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $post->setContent($content);
             $post->setPublishedAt($publishedAt);
             $post->setAuthor($author);
-            $post->addTag(...$tags);
+            
             foreach (range(1, 5) as $i) {
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));

99) /usr/src/myapp/src/DataFixtures/AppFixtures.php:81    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $post->setPublishedAt($publishedAt);
             $post->setAuthor($author);
             $post->addTag(...$tags);
-            foreach (range(1, 5) as $i) {
+            foreach (range(0, 5) as $i) {
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
                 $comment->setContent($this->getRandomText(random_int(255, 512)));

100) /usr/src/myapp/src/DataFixtures/AppFixtures.php:81    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $post->setPublishedAt($publishedAt);
             $post->setAuthor($author);
             $post->addTag(...$tags);
-            foreach (range(1, 5) as $i) {
+            foreach (range(2, 5) as $i) {
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
                 $comment->setContent($this->getRandomText(random_int(255, 512)));

101) /usr/src/myapp/src/DataFixtures/AppFixtures.php:81    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $post->setPublishedAt($publishedAt);
             $post->setAuthor($author);
             $post->addTag(...$tags);
-            foreach (range(1, 5) as $i) {
+            foreach (range(1, 4) as $i) {
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
                 $comment->setContent($this->getRandomText(random_int(255, 512)));

102) /usr/src/myapp/src/DataFixtures/AppFixtures.php:81    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $post->setPublishedAt($publishedAt);
             $post->setAuthor($author);
             $post->addTag(...$tags);
-            foreach (range(1, 5) as $i) {
+            foreach (range(1, 6) as $i) {
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
                 $comment->setContent($this->getRandomText(random_int(255, 512)));

103) /usr/src/myapp/src/DataFixtures/AppFixtures.php:81    [M] Foreach_

--- Original
+++ New
@@ @@
             $post->setPublishedAt($publishedAt);
             $post->setAuthor($author);
             $post->addTag(...$tags);
-            foreach (range(1, 5) as $i) {
+            foreach (array() as $i) {
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
                 $comment->setContent($this->getRandomText(random_int(255, 512)));

104) /usr/src/myapp/src/DataFixtures/AppFixtures.php:83    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $post->addTag(...$tags);
             foreach (range(1, 5) as $i) {
                 $comment = new Comment();
-                $comment->setAuthor($this->getReference('john_user'));
+                
                 $comment->setContent($this->getRandomText(random_int(255, 512)));
                 $comment->setPublishedAt(new \DateTime('now + ' . $i . 'seconds'));
                 $post->addComment($comment);

105) /usr/src/myapp/src/DataFixtures/AppFixtures.php:84    [M] DecrementInteger

--- Original
+++ New
@@ @@
             foreach (range(1, 5) as $i) {
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
-                $comment->setContent($this->getRandomText(random_int(255, 512)));
+                $comment->setContent($this->getRandomText(random_int(254, 512)));
                 $comment->setPublishedAt(new \DateTime('now + ' . $i . 'seconds'));
                 $post->addComment($comment);
             }

106) /usr/src/myapp/src/DataFixtures/AppFixtures.php:84    [M] IncrementInteger

--- Original
+++ New
@@ @@
             foreach (range(1, 5) as $i) {
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
-                $comment->setContent($this->getRandomText(random_int(255, 512)));
+                $comment->setContent($this->getRandomText(random_int(256, 512)));
                 $comment->setPublishedAt(new \DateTime('now + ' . $i . 'seconds'));
                 $post->addComment($comment);
             }

107) /usr/src/myapp/src/DataFixtures/AppFixtures.php:84    [M] DecrementInteger

--- Original
+++ New
@@ @@
             foreach (range(1, 5) as $i) {
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
-                $comment->setContent($this->getRandomText(random_int(255, 512)));
+                $comment->setContent($this->getRandomText(random_int(255, 511)));
                 $comment->setPublishedAt(new \DateTime('now + ' . $i . 'seconds'));
                 $post->addComment($comment);
             }

108) /usr/src/myapp/src/DataFixtures/AppFixtures.php:84    [M] IncrementInteger

--- Original
+++ New
@@ @@
             foreach (range(1, 5) as $i) {
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
-                $comment->setContent($this->getRandomText(random_int(255, 512)));
+                $comment->setContent($this->getRandomText(random_int(255, 513)));
                 $comment->setPublishedAt(new \DateTime('now + ' . $i . 'seconds'));
                 $post->addComment($comment);
             }

109) /usr/src/myapp/src/DataFixtures/AppFixtures.php:84    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             foreach (range(1, 5) as $i) {
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
-                $comment->setContent($this->getRandomText(random_int(255, 512)));
+                
                 $comment->setPublishedAt(new \DateTime('now + ' . $i . 'seconds'));
                 $post->addComment($comment);
             }

110) /usr/src/myapp/src/DataFixtures/AppFixtures.php:85    [M] Concat

--- Original
+++ New
@@ @@
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
                 $comment->setContent($this->getRandomText(random_int(255, 512)));
-                $comment->setPublishedAt(new \DateTime('now + ' . $i . 'seconds'));
+                $comment->setPublishedAt(new \DateTime($i . 'now + ' . 'seconds'));
                 $post->addComment($comment);
             }
             $manager->persist($post);

111) /usr/src/myapp/src/DataFixtures/AppFixtures.php:85    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
                 $comment->setContent($this->getRandomText(random_int(255, 512)));
-                $comment->setPublishedAt(new \DateTime('now + ' . $i . 'seconds'));
+                $comment->setPublishedAt(new \DateTime($i . 'seconds'));
                 $post->addComment($comment);
             }
             $manager->persist($post);

112) /usr/src/myapp/src/DataFixtures/AppFixtures.php:85    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
                 $comment->setContent($this->getRandomText(random_int(255, 512)));
-                $comment->setPublishedAt(new \DateTime('now + ' . $i . 'seconds'));
+                $comment->setPublishedAt(new \DateTime('now + ' . 'seconds'));
                 $post->addComment($comment);
             }
             $manager->persist($post);

113) /usr/src/myapp/src/DataFixtures/AppFixtures.php:85    [M] Concat

--- Original
+++ New
@@ @@
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
                 $comment->setContent($this->getRandomText(random_int(255, 512)));
-                $comment->setPublishedAt(new \DateTime('now + ' . $i . 'seconds'));
+                $comment->setPublishedAt(new \DateTime('now + ' . 'seconds' . $i));
                 $post->addComment($comment);
             }
             $manager->persist($post);

114) /usr/src/myapp/src/DataFixtures/AppFixtures.php:85    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
                 $comment->setContent($this->getRandomText(random_int(255, 512)));
-                $comment->setPublishedAt(new \DateTime('now + ' . $i . 'seconds'));
+                $comment->setPublishedAt(new \DateTime('now + ' . $i));
                 $post->addComment($comment);
             }
             $manager->persist($post);

115) /usr/src/myapp/src/DataFixtures/AppFixtures.php:85    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $comment = new Comment();
                 $comment->setAuthor($this->getReference('john_user'));
                 $comment->setContent($this->getRandomText(random_int(255, 512)));
-                $comment->setPublishedAt(new \DateTime('now + ' . $i . 'seconds'));
+                
                 $post->addComment($comment);
             }
             $manager->persist($post);

116) /usr/src/myapp/src/DataFixtures/AppFixtures.php:87    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $comment->setAuthor($this->getReference('john_user'));
                 $comment->setContent($this->getRandomText(random_int(255, 512)));
                 $comment->setPublishedAt(new \DateTime('now + ' . $i . 'seconds'));
-                $post->addComment($comment);
+                
             }
             $manager->persist($post);
         }

117) /usr/src/myapp/src/DataFixtures/AppFixtures.php:90    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $comment->setPublishedAt(new \DateTime('now + ' . $i . 'seconds'));
                 $post->addComment($comment);
             }
-            $manager->persist($post);
+            
         }
         $manager->flush();
     }

119) /usr/src/myapp/src/DataFixtures/AppFixtures.php:98    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     private function getUserData() : array
     {
-        return [
-            // $userData = [$fullname, $username, $password, $email, $roles];
-            ['Jane Doe', 'jane_admin', 'kitten', 'jane_admin@symfony.com', ['ROLE_ADMIN']],
-            ['Tom Doe', 'tom_admin', 'kitten', 'tom_admin@symfony.com', ['ROLE_ADMIN']],
-            ['John Doe', 'john_user', 'kitten', 'john_user@symfony.com', ['ROLE_USER']],
-        ];
+        return [['Tom Doe', 'tom_admin', 'kitten', 'tom_admin@symfony.com', ['ROLE_ADMIN']], ['John Doe', 'john_user', 'kitten', 'john_user@symfony.com', ['ROLE_USER']]];
     }
     private function getTagData() : array
     {

120) /usr/src/myapp/src/DataFixtures/AppFixtures.php:100    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         return [
             // $userData = [$fullname, $username, $password, $email, $roles];
-            ['Jane Doe', 'jane_admin', 'kitten', 'jane_admin@symfony.com', ['ROLE_ADMIN']],
+            ['Jane Doe', 'jane_admin', 'kitten', 'jane_admin@symfony.com', []],
             ['Tom Doe', 'tom_admin', 'kitten', 'tom_admin@symfony.com', ['ROLE_ADMIN']],
             ['John Doe', 'john_user', 'kitten', 'john_user@symfony.com', ['ROLE_USER']],
         ];

121) /usr/src/myapp/src/DataFixtures/AppFixtures.php:100    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         return [
             // $userData = [$fullname, $username, $password, $email, $roles];
-            ['Jane Doe', 'jane_admin', 'kitten', 'jane_admin@symfony.com', ['ROLE_ADMIN']],
+            ['jane_admin', 'kitten', 'jane_admin@symfony.com', ['ROLE_ADMIN']],
             ['Tom Doe', 'tom_admin', 'kitten', 'tom_admin@symfony.com', ['ROLE_ADMIN']],
             ['John Doe', 'john_user', 'kitten', 'john_user@symfony.com', ['ROLE_USER']],
         ];

122) /usr/src/myapp/src/DataFixtures/AppFixtures.php:101    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         return [
             // $userData = [$fullname, $username, $password, $email, $roles];
             ['Jane Doe', 'jane_admin', 'kitten', 'jane_admin@symfony.com', ['ROLE_ADMIN']],
-            ['Tom Doe', 'tom_admin', 'kitten', 'tom_admin@symfony.com', ['ROLE_ADMIN']],
+            ['Tom Doe', 'tom_admin', 'kitten', 'tom_admin@symfony.com', []],
             ['John Doe', 'john_user', 'kitten', 'john_user@symfony.com', ['ROLE_USER']],
         ];
     }

123) /usr/src/myapp/src/DataFixtures/AppFixtures.php:101    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         return [
             // $userData = [$fullname, $username, $password, $email, $roles];
             ['Jane Doe', 'jane_admin', 'kitten', 'jane_admin@symfony.com', ['ROLE_ADMIN']],
-            ['Tom Doe', 'tom_admin', 'kitten', 'tom_admin@symfony.com', ['ROLE_ADMIN']],
+            ['tom_admin', 'kitten', 'tom_admin@symfony.com', ['ROLE_ADMIN']],
             ['John Doe', 'john_user', 'kitten', 'john_user@symfony.com', ['ROLE_USER']],
         ];
     }

124) /usr/src/myapp/src/DataFixtures/AppFixtures.php:102    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             // $userData = [$fullname, $username, $password, $email, $roles];
             ['Jane Doe', 'jane_admin', 'kitten', 'jane_admin@symfony.com', ['ROLE_ADMIN']],
             ['Tom Doe', 'tom_admin', 'kitten', 'tom_admin@symfony.com', ['ROLE_ADMIN']],
-            ['John Doe', 'john_user', 'kitten', 'john_user@symfony.com', ['ROLE_USER']],
+            ['John Doe', 'john_user', 'kitten', 'john_user@symfony.com', []],
         ];
     }
     private function getTagData() : array

125) /usr/src/myapp/src/DataFixtures/AppFixtures.php:102    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             // $userData = [$fullname, $username, $password, $email, $roles];
             ['Jane Doe', 'jane_admin', 'kitten', 'jane_admin@symfony.com', ['ROLE_ADMIN']],
             ['Tom Doe', 'tom_admin', 'kitten', 'tom_admin@symfony.com', ['ROLE_ADMIN']],
-            ['John Doe', 'john_user', 'kitten', 'john_user@symfony.com', ['ROLE_USER']],
+            ['john_user', 'kitten', 'john_user@symfony.com', ['ROLE_USER']],
         ];
     }
     private function getTagData() : array

126) /usr/src/myapp/src/DataFixtures/AppFixtures.php:108    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     private function getTagData() : array
     {
-        return ['lorem', 'ipsum', 'consectetur', 'adipiscing', 'incididunt', 'labore', 'voluptate', 'dolore', 'pariatur'];
+        return ['ipsum', 'consectetur', 'adipiscing', 'incididunt', 'labore', 'voluptate', 'dolore', 'pariatur'];
     }
     private function getPostData() : array
     {

127) /usr/src/myapp/src/DataFixtures/AppFixtures.php:124    [M] Foreach_

--- Original
+++ New
@@ @@
     private function getPostData() : array
     {
         $posts = [];
-        foreach ($this->getPhrases() as $i => $title) {
+        foreach (array() as $i => $title) {
             // $postData = [$title, $slug, $summary, $content, $publishedAt, $author, $tags, $comments];
             $posts[] = [
                 $title,

129) /usr/src/myapp/src/DataFixtures/AppFixtures.php:131    [M] Concat

--- Original
+++ New
@@ @@
                 $this->slugger->slug($title)->lower(),
                 $this->getRandomText(),
                 $this->getPostContent(),
-                new \DateTime('now - ' . $i . 'days'),
+                new \DateTime($i . 'now - ' . 'days'),
                 // Ensure that the first post is written by Jane Doe to simplify tests
                 $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
                 $this->getRandomTags(),

130) /usr/src/myapp/src/DataFixtures/AppFixtures.php:131    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $this->slugger->slug($title)->lower(),
                 $this->getRandomText(),
                 $this->getPostContent(),
-                new \DateTime('now - ' . $i . 'days'),
+                new \DateTime($i . 'days'),
                 // Ensure that the first post is written by Jane Doe to simplify tests
                 $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
                 $this->getRandomTags(),

131) /usr/src/myapp/src/DataFixtures/AppFixtures.php:131    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $this->slugger->slug($title)->lower(),
                 $this->getRandomText(),
                 $this->getPostContent(),
-                new \DateTime('now - ' . $i . 'days'),
+                new \DateTime('now - ' . 'days'),
                 // Ensure that the first post is written by Jane Doe to simplify tests
                 $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
                 $this->getRandomTags(),

132) /usr/src/myapp/src/DataFixtures/AppFixtures.php:131    [M] Concat

--- Original
+++ New
@@ @@
                 $this->slugger->slug($title)->lower(),
                 $this->getRandomText(),
                 $this->getPostContent(),
-                new \DateTime('now - ' . $i . 'days'),
+                new \DateTime('now - ' . 'days' . $i),
                 // Ensure that the first post is written by Jane Doe to simplify tests
                 $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
                 $this->getRandomTags(),

133) /usr/src/myapp/src/DataFixtures/AppFixtures.php:131    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $this->slugger->slug($title)->lower(),
                 $this->getRandomText(),
                 $this->getPostContent(),
-                new \DateTime('now - ' . $i . 'days'),
+                new \DateTime('now - ' . $i),
                 // Ensure that the first post is written by Jane Doe to simplify tests
                 $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
                 $this->getRandomTags(),

134) /usr/src/myapp/src/DataFixtures/AppFixtures.php:133    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $this->getPostContent(),
                 new \DateTime('now - ' . $i . 'days'),
                 // Ensure that the first post is written by Jane Doe to simplify tests
-                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
+                $this->getReference(['tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
                 $this->getRandomTags(),
             ];
         }

135) /usr/src/myapp/src/DataFixtures/AppFixtures.php:133    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 $this->getPostContent(),
                 new \DateTime('now - ' . $i . 'days'),
                 // Ensure that the first post is written by Jane Doe to simplify tests
-                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
+                $this->getReference(['jane_admin', 'tom_admin'][-1 === $i ? 0 : random_int(0, 1)]),
                 $this->getRandomTags(),
             ];
         }

136) /usr/src/myapp/src/DataFixtures/AppFixtures.php:133    [M] Identical

--- Original
+++ New
@@ @@
                 $this->getPostContent(),
                 new \DateTime('now - ' . $i . 'days'),
                 // Ensure that the first post is written by Jane Doe to simplify tests
-                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
+                $this->getReference(['jane_admin', 'tom_admin'][0 !== $i ? 0 : random_int(0, 1)]),
                 $this->getRandomTags(),
             ];
         }

137) /usr/src/myapp/src/DataFixtures/AppFixtures.php:133    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 $this->getPostContent(),
                 new \DateTime('now - ' . $i . 'days'),
                 // Ensure that the first post is written by Jane Doe to simplify tests
-                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
+                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? -1 : random_int(0, 1)]),
                 $this->getRandomTags(),
             ];
         }

138) /usr/src/myapp/src/DataFixtures/AppFixtures.php:133    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $this->getPostContent(),
                 new \DateTime('now - ' . $i . 'days'),
                 // Ensure that the first post is written by Jane Doe to simplify tests
-                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
+                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 1 : random_int(0, 1)]),
                 $this->getRandomTags(),
             ];
         }

139) /usr/src/myapp/src/DataFixtures/AppFixtures.php:133    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 $this->getPostContent(),
                 new \DateTime('now - ' . $i . 'days'),
                 // Ensure that the first post is written by Jane Doe to simplify tests
-                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
+                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(-1, 1)]),
                 $this->getRandomTags(),
             ];
         }

140) /usr/src/myapp/src/DataFixtures/AppFixtures.php:133    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $this->getPostContent(),
                 new \DateTime('now - ' . $i . 'days'),
                 // Ensure that the first post is written by Jane Doe to simplify tests
-                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
+                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(1, 1)]),
                 $this->getRandomTags(),
             ];
         }

141) /usr/src/myapp/src/DataFixtures/AppFixtures.php:133    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 $this->getPostContent(),
                 new \DateTime('now - ' . $i . 'days'),
                 // Ensure that the first post is written by Jane Doe to simplify tests
-                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
+                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 0)]),
                 $this->getRandomTags(),
             ];
         }

142) /usr/src/myapp/src/DataFixtures/AppFixtures.php:133    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $this->getPostContent(),
                 new \DateTime('now - ' . $i . 'days'),
                 // Ensure that the first post is written by Jane Doe to simplify tests
-                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
+                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 2)]),
                 $this->getRandomTags(),
             ];
         }

143) /usr/src/myapp/src/DataFixtures/AppFixtures.php:133    [M] Ternary

--- Original
+++ New
@@ @@
                 $this->getPostContent(),
                 new \DateTime('now - ' . $i . 'days'),
                 // Ensure that the first post is written by Jane Doe to simplify tests
-                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? 0 : random_int(0, 1)]),
+                $this->getReference(['jane_admin', 'tom_admin'][0 === $i ? random_int(0, 1) : 0]),
                 $this->getRandomTags(),
             ];
         }

144) /usr/src/myapp/src/DataFixtures/AppFixtures.php:138    [M] ArrayOneItem

--- Original
+++ New
@@ @@
                 $this->getRandomTags(),
             ];
         }
-        return $posts;
+        return count($posts) > 1 ? array_slice($posts, 0, 1, true) : $posts;
     }
     private function getPhrases() : array
     {

146) /usr/src/myapp/src/DataFixtures/AppFixtures.php:177    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
     }
-    private function getRandomText(int $maxLength = 255) : string
+    private function getRandomText(int $maxLength = 254) : string
     {
         $phrases = $this->getPhrases();
         shuffle($phrases);

147) /usr/src/myapp/src/DataFixtures/AppFixtures.php:177    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
     }
-    private function getRandomText(int $maxLength = 255) : string
+    private function getRandomText(int $maxLength = 256) : string
     {
         $phrases = $this->getPhrases();
         shuffle($phrases);

148) /usr/src/myapp/src/DataFixtures/AppFixtures.php:180    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     private function getRandomText(int $maxLength = 255) : string
     {
         $phrases = $this->getPhrases();
-        shuffle($phrases);
+        
         do {
             $text = u('. ')->join($phrases)->append('.');
             array_pop($phrases);

149) /usr/src/myapp/src/DataFixtures/AppFixtures.php:182    [M] DoWhile

--- Original
+++ New
@@ @@
         do {
             $text = u('. ')->join($phrases)->append('.');
             array_pop($phrases);
-        } while ($text->length() > $maxLength);
+        } while (false);
         return $text;
     }
     private function getPostContent() : string

150) /usr/src/myapp/src/DataFixtures/AppFixtures.php:184    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         shuffle($phrases);
         do {
             $text = u('. ')->join($phrases)->append('.');
-            array_pop($phrases);
+            
         } while ($text->length() > $maxLength);
         return $text;
     }

151) /usr/src/myapp/src/DataFixtures/AppFixtures.php:185    [M] GreaterThan

--- Original
+++ New
@@ @@
         do {
             $text = u('. ')->join($phrases)->append('.');
             array_pop($phrases);
-        } while ($text->length() > $maxLength);
+        } while ($text->length() >= $maxLength);
         return $text;
     }
     private function getPostContent() : string

152) /usr/src/myapp/src/DataFixtures/AppFixtures.php:185    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
         do {
             $text = u('. ')->join($phrases)->append('.');
             array_pop($phrases);
-        } while ($text->length() > $maxLength);
+        } while ($text->length() <= $maxLength);
         return $text;
     }
     private function getPostContent() : string
