153) /usr/src/myapp/src/DataFixtures/AppFixtures.php:233    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     private function getRandomTags() : array
     {
         $tagNames = $this->getTagData();
-        shuffle($tagNames);
+        
         $selectedTags = \array_slice($tagNames, 0, random_int(2, 4));
         return array_map(function ($tagName) {
             return $this->getReference('tag-' . $tagName);

154) /usr/src/myapp/src/DataFixtures/AppFixtures.php:234    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $tagNames = $this->getTagData();
         shuffle($tagNames);
-        $selectedTags = \array_slice($tagNames, 0, random_int(2, 4));
+        $selectedTags = \array_slice($tagNames, -1, random_int(2, 4));
         return array_map(function ($tagName) {
             return $this->getReference('tag-' . $tagName);
         }, $selectedTags);
     }
 }

155) /usr/src/myapp/src/DataFixtures/AppFixtures.php:234    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $tagNames = $this->getTagData();
         shuffle($tagNames);
-        $selectedTags = \array_slice($tagNames, 0, random_int(2, 4));
+        $selectedTags = \array_slice($tagNames, 1, random_int(2, 4));
         return array_map(function ($tagName) {
             return $this->getReference('tag-' . $tagName);
         }, $selectedTags);
     }
 }

156) /usr/src/myapp/src/DataFixtures/AppFixtures.php:234    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $tagNames = $this->getTagData();
         shuffle($tagNames);
-        $selectedTags = \array_slice($tagNames, 0, random_int(2, 4));
+        $selectedTags = \array_slice($tagNames, 0, random_int(1, 4));
         return array_map(function ($tagName) {
             return $this->getReference('tag-' . $tagName);
         }, $selectedTags);
     }
 }

157) /usr/src/myapp/src/DataFixtures/AppFixtures.php:234    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $tagNames = $this->getTagData();
         shuffle($tagNames);
-        $selectedTags = \array_slice($tagNames, 0, random_int(2, 4));
+        $selectedTags = \array_slice($tagNames, 0, random_int(3, 4));
         return array_map(function ($tagName) {
             return $this->getReference('tag-' . $tagName);
         }, $selectedTags);
     }
 }

158) /usr/src/myapp/src/DataFixtures/AppFixtures.php:234    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $tagNames = $this->getTagData();
         shuffle($tagNames);
-        $selectedTags = \array_slice($tagNames, 0, random_int(2, 4));
+        $selectedTags = \array_slice($tagNames, 0, random_int(2, 3));
         return array_map(function ($tagName) {
             return $this->getReference('tag-' . $tagName);
         }, $selectedTags);
     }
 }

159) /usr/src/myapp/src/DataFixtures/AppFixtures.php:234    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $tagNames = $this->getTagData();
         shuffle($tagNames);
-        $selectedTags = \array_slice($tagNames, 0, random_int(2, 4));
+        $selectedTags = \array_slice($tagNames, 0, random_int(2, 5));
         return array_map(function ($tagName) {
             return $this->getReference('tag-' . $tagName);
         }, $selectedTags);
     }
 }

160) /usr/src/myapp/src/DataFixtures/AppFixtures.php:234    [M] UnwrapArraySlice

--- Original
+++ New
@@ @@
     {
         $tagNames = $this->getTagData();
         shuffle($tagNames);
-        $selectedTags = \array_slice($tagNames, 0, random_int(2, 4));
+        $selectedTags = $tagNames;
         return array_map(function ($tagName) {
             return $this->getReference('tag-' . $tagName);
         }, $selectedTags);
     }
 }

161) /usr/src/myapp/src/DataFixtures/AppFixtures.php:236    [M] Concat

--- Original
+++ New
@@ @@
         shuffle($tagNames);
         $selectedTags = \array_slice($tagNames, 0, random_int(2, 4));
         return array_map(function ($tagName) {
-            return $this->getReference('tag-' . $tagName);
+            return $this->getReference($tagName . 'tag-');
         }, $selectedTags);
     }
 }

162) /usr/src/myapp/src/DataFixtures/AppFixtures.php:236    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         shuffle($tagNames);
         $selectedTags = \array_slice($tagNames, 0, random_int(2, 4));
         return array_map(function ($tagName) {
-            return $this->getReference('tag-' . $tagName);
+            return $this->getReference($tagName);
         }, $selectedTags);
     }
 }

163) /usr/src/myapp/src/DataFixtures/AppFixtures.php:236    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         shuffle($tagNames);
         $selectedTags = \array_slice($tagNames, 0, random_int(2, 4));
         return array_map(function ($tagName) {
-            return $this->getReference('tag-' . $tagName);
+            return $this->getReference('tag-');
         }, $selectedTags);
     }
 }

164) /usr/src/myapp/src/DataFixtures/AppFixtures.php:236    [M] UnwrapArrayMap

--- Original
+++ New
@@ @@
         $tagNames = $this->getTagData();
         shuffle($tagNames);
         $selectedTags = \array_slice($tagNames, 0, random_int(2, 4));
-        return array_map(function ($tagName) {
-            return $this->getReference('tag-' . $tagName);
-        }, $selectedTags);
+        return $selectedTags;
     }
 }

165) /usr/src/myapp/src/Entity/Comment.php:86    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->publishedAt;
     }
-    public function setPublishedAt(\DateTime $publishedAt) : void
+    protected function setPublishedAt(\DateTime $publishedAt) : void
     {
         $this->publishedAt = $publishedAt;
     }

166) /usr/src/myapp/src/Entity/Post.php:158    [M] PublicVisibility

--- Original
+++ New
@@ @@
             $this->comments->add($comment);
         }
     }
-    public function removeComment(Comment $comment) : void
+    protected function removeComment(Comment $comment) : void
     {
         $this->comments->removeElement($comment);
     }

167) /usr/src/myapp/src/Entity/Post.php:160    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function removeComment(Comment $comment) : void
     {
-        $this->comments->removeElement($comment);
+        
     }
     public function getSummary() : ?string
     {

168) /usr/src/myapp/src/Entity/Post.php:173    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->summary = $summary;
     }
-    public function addTag(Tag ...$tags) : void
+    protected function addTag(Tag ...$tags) : void
     {
         foreach ($tags as $tag) {
             if (!$this->tags->contains($tag)) {

169) /usr/src/myapp/src/Entity/Post.php:175    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     public function addTag(Tag ...$tags) : void
     {
-        foreach ($tags as $tag) {
+        foreach (array() as $tag) {
             if (!$this->tags->contains($tag)) {
                 $this->tags->add($tag);
             }

170) /usr/src/myapp/src/Entity/Post.php:176    [M] LogicalNot

--- Original
+++ New
@@ @@
     public function addTag(Tag ...$tags) : void
     {
         foreach ($tags as $tag) {
-            if (!$this->tags->contains($tag)) {
+            if ($this->tags->contains($tag)) {
                 $this->tags->add($tag);
             }
         }

171) /usr/src/myapp/src/Entity/Post.php:177    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         foreach ($tags as $tag) {
             if (!$this->tags->contains($tag)) {
-                $this->tags->add($tag);
+                
             }
         }
     }

172) /usr/src/myapp/src/Entity/Post.php:182    [M] PublicVisibility

--- Original
+++ New
@@ @@
             }
         }
     }
-    public function removeTag(Tag $tag) : void
+    protected function removeTag(Tag $tag) : void
     {
         $this->tags->removeElement($tag);
     }

173) /usr/src/myapp/src/Entity/Post.php:184    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function removeTag(Tag $tag) : void
     {
-        $this->tags->removeElement($tag);
+        
     }
     public function getTags() : Collection
     {

174) /usr/src/myapp/src/Entity/Tag.php:35    [M] PublicVisibility

--- Original
+++ New
@@ @@
     private ?int $id = null;
     #[ORM\Column(type: 'string', unique: true)]
     private ?string $name = null;
-    public function getId() : ?int
+    protected function getId() : ?int
     {
         return $this->id;
     }

175) /usr/src/myapp/src/Entity/User.php:133    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * {@inheritdoc}
      */
-    public function getSalt() : ?string
+    protected function getSalt() : ?string
     {
         // We're using bcrypt in security.yaml to encode the password, so
         // the salt value is built-in and you don't have to generate one

177) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:58    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * the database and then, it checks if the 'sqlite3' PHP extension is enabled
      * or not to display a better error message.
      */
-    public function handleConsoleError(ConsoleErrorEvent $event) : void
+    protected function handleConsoleError(ConsoleErrorEvent $event) : void
     {
         $commandNames = ['doctrine:fixtures:load', 'doctrine:database:create', 'doctrine:schema:create', 'doctrine:database:drop'];
         if ($event->getCommand() && \in_array($event->getCommand()->getName(), $commandNames, true)) {

178) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:60    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function handleConsoleError(ConsoleErrorEvent $event) : void
     {
-        $commandNames = ['doctrine:fixtures:load', 'doctrine:database:create', 'doctrine:schema:create', 'doctrine:database:drop'];
+        $commandNames = ['doctrine:database:create', 'doctrine:schema:create', 'doctrine:database:drop'];
         if ($event->getCommand() && \in_array($event->getCommand()->getName(), $commandNames, true)) {
             if ($this->isSQLitePlatform() && !\extension_loaded('sqlite3')) {
                 $io = new SymfonyStyle($event->getInput(), $event->getOutput());

179) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:62    [M] LogicalAnd

--- Original
+++ New
@@ @@
     public function handleConsoleError(ConsoleErrorEvent $event) : void
     {
         $commandNames = ['doctrine:fixtures:load', 'doctrine:database:create', 'doctrine:schema:create', 'doctrine:database:drop'];
-        if ($event->getCommand() && \in_array($event->getCommand()->getName(), $commandNames, true)) {
+        if ($event->getCommand() || \in_array($event->getCommand()->getName(), $commandNames, true)) {
             if ($this->isSQLitePlatform() && !\extension_loaded('sqlite3')) {
                 $io = new SymfonyStyle($event->getInput(), $event->getOutput());
                 $io->error('This command requires to have the "sqlite3" PHP extension enabled because, by default, the Symfony Demo application uses SQLite to store its information.');

180) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:63    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
         $commandNames = ['doctrine:fixtures:load', 'doctrine:database:create', 'doctrine:schema:create', 'doctrine:database:drop'];
         if ($event->getCommand() && \in_array($event->getCommand()->getName(), $commandNames, true)) {
-            if ($this->isSQLitePlatform() && !\extension_loaded('sqlite3')) {
+            if ($this->isSQLitePlatform() && \extension_loaded('sqlite3')) {
                 $io = new SymfonyStyle($event->getInput(), $event->getOutput());
                 $io->error('This command requires to have the "sqlite3" PHP extension enabled because, by default, the Symfony Demo application uses SQLite to store its information.');
             }

181) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:63    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
         $commandNames = ['doctrine:fixtures:load', 'doctrine:database:create', 'doctrine:schema:create', 'doctrine:database:drop'];
         if ($event->getCommand() && \in_array($event->getCommand()->getName(), $commandNames, true)) {
-            if ($this->isSQLitePlatform() && !\extension_loaded('sqlite3')) {
+            if ($this->isSQLitePlatform() || !\extension_loaded('sqlite3')) {
                 $io = new SymfonyStyle($event->getInput(), $event->getOutput());
                 $io->error('This command requires to have the "sqlite3" PHP extension enabled because, by default, the Symfony Demo application uses SQLite to store its information.');
             }

182) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:65    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($event->getCommand() && \in_array($event->getCommand()->getName(), $commandNames, true)) {
             if ($this->isSQLitePlatform() && !\extension_loaded('sqlite3')) {
                 $io = new SymfonyStyle($event->getInput(), $event->getOutput());
-                $io->error('This command requires to have the "sqlite3" PHP extension enabled because, by default, the Symfony Demo application uses SQLite to store its information.');
+                
             }
         }
     }

183) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:86    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $isDriverException = $exception instanceof DriverException || $previousException instanceof DriverException;
         // Check if SQLite is enabled
         if ($isDriverException && $this->isSQLitePlatform() && !\extension_loaded('sqlite3')) {
-            $event->setThrowable(new \Exception('PHP extension "sqlite3" must be enabled because, by default, the Symfony Demo application uses SQLite to store its information.'));
+            
         }
     }
     /**

184) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:97    [M] Identical

--- Original
+++ New
@@ @@
     private function isSQLitePlatform() : bool
     {
         $databasePlatform = $this->entityManager->getConnection()->getDatabasePlatform();
-        return $databasePlatform ? 'sqlite' === $databasePlatform->getName() : false;
+        return $databasePlatform ? 'sqlite' !== $databasePlatform->getName() : false;
     }
 }

185) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:97    [M] FalseValue

--- Original
+++ New
@@ @@
     private function isSQLitePlatform() : bool
     {
         $databasePlatform = $this->entityManager->getConnection()->getDatabasePlatform();
-        return $databasePlatform ? 'sqlite' === $databasePlatform->getName() : false;
+        return $databasePlatform ? 'sqlite' === $databasePlatform->getName() : true;
     }
 }

186) /usr/src/myapp/src/EventSubscriber/CheckRequirementsSubscriber.php:97    [M] Ternary

--- Original
+++ New
@@ @@
     private function isSQLitePlatform() : bool
     {
         $databasePlatform = $this->entityManager->getConnection()->getDatabasePlatform();
-        return $databasePlatform ? 'sqlite' === $databasePlatform->getName() : false;
+        return $databasePlatform ? false : 'sqlite' === $databasePlatform->getName();
     }
 }

187) /usr/src/myapp/src/EventSubscriber/CommentNotificationSubscriber.php:38    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public static function getSubscribedEvents() : array
     {
-        return [CommentCreatedEvent::class => 'onCommentCreated'];
+        return [];
     }
     public function onCommentCreated(CommentCreatedEvent $event) : void
     {

188) /usr/src/myapp/src/EventSubscriber/ControllerSubscriber.php:35    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public static function getSubscribedEvents() : array
     {
-        return [KernelEvents::CONTROLLER => 'registerCurrentController'];
+        return [];
     }
     public function registerCurrentController(ControllerEvent $event) : void
     {

189) /usr/src/myapp/src/EventSubscriber/RedirectToPreferredLocaleSubscriber.php:41    [M] Throw_

--- Original
+++ New
@@ @@
     {
         $this->locales = explode('|', trim($locales));
         if (empty($this->locales)) {
-            throw new \UnexpectedValueException('The list of supported locales must not be empty.');
+            new \UnexpectedValueException('The list of supported locales must not be empty.');
         }
         $this->defaultLocale = $defaultLocale ?: $this->locales[0];
         if (!\in_array($this->defaultLocale, $this->locales, true)) {

190) /usr/src/myapp/src/EventSubscriber/RedirectToPreferredLocaleSubscriber.php:47    [M] Throw_

--- Original
+++ New
@@ @@
         }
         $this->defaultLocale = $defaultLocale ?: $this->locales[0];
         if (!\in_array($this->defaultLocale, $this->locales, true)) {
-            throw new \UnexpectedValueException(sprintf('The default locale ("%s") must be one of "%s".', $this->defaultLocale, $locales));
+            new \UnexpectedValueException(sprintf('The default locale ("%s") must be one of "%s".', $this->defaultLocale, $locales));
         }
         // Add the default locale at the first position of the array,
         // because Symfony\HttpFoundation\Request::getPreferredLanguage

191) /usr/src/myapp/src/EventSubscriber/RedirectToPreferredLocaleSubscriber.php:59    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public static function getSubscribedEvents() : array
     {
-        return [KernelEvents::REQUEST => 'onKernelRequest'];
+        return [];
     }
     public function onKernelRequest(RequestEvent $event) : void
     {

192) /usr/src/myapp/src/EventSubscriber/RedirectToPreferredLocaleSubscriber.php:82    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $preferredLanguage = $request->getPreferredLanguage($this->locales);
         if ($preferredLanguage !== $this->defaultLocale) {
-            $response = new RedirectResponse($this->urlGenerator->generate('homepage', ['_locale' => $preferredLanguage]));
+            $response = new RedirectResponse($this->urlGenerator->generate('homepage', []));
             $event->setResponse($response);
         }
     }
 }

193) /usr/src/myapp/src/EventSubscriber/RedirectToPreferredLocaleSubscriber.php:83    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $preferredLanguage = $request->getPreferredLanguage($this->locales);
         if ($preferredLanguage !== $this->defaultLocale) {
             $response = new RedirectResponse($this->urlGenerator->generate('homepage', ['_locale' => $preferredLanguage]));
-            $event->setResponse($response);
+            
         }
     }
 }

194) /usr/src/myapp/src/Pagination/Paginator.php:52    [M] FalseValue

--- Original
+++ New
@@ @@
         $firstResult = ($this->currentPage - 1) * $this->pageSize;
         $query = $this->queryBuilder->setFirstResult($firstResult)->setMaxResults($this->pageSize)->getQuery();
         if (0 === \count($this->queryBuilder->getDQLPart('join'))) {
-            $query->setHint(CountWalker::HINT_DISTINCT, false);
+            $query->setHint(CountWalker::HINT_DISTINCT, true);
         }
         $paginator = new DoctrinePaginator($query, true);
         $useOutputWalkers = \count($this->queryBuilder->getDQLPart('having') ?: []) > 0;

195) /usr/src/myapp/src/Pagination/Paginator.php:52    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $firstResult = ($this->currentPage - 1) * $this->pageSize;
         $query = $this->queryBuilder->setFirstResult($firstResult)->setMaxResults($this->pageSize)->getQuery();
         if (0 === \count($this->queryBuilder->getDQLPart('join'))) {
-            $query->setHint(CountWalker::HINT_DISTINCT, false);
+            
         }
         $paginator = new DoctrinePaginator($query, true);
         $useOutputWalkers = \count($this->queryBuilder->getDQLPart('having') ?: []) > 0;

196) /usr/src/myapp/src/Pagination/Paginator.php:76    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return (int) ceil($this->numResults / $this->pageSize);
     }
-    public function getPageSize() : int
+    protected function getPageSize() : int
     {
         return $this->pageSize;
     }

197) /usr/src/myapp/src/Pagination/Paginator.php:86    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->currentPage > 1;
     }
-    public function getPreviousPage() : int
+    protected function getPreviousPage() : int
     {
         return max(1, $this->currentPage - 1);
     }

198) /usr/src/myapp/src/Pagination/Paginator.php:88    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function getPreviousPage() : int
     {
-        return max(1, $this->currentPage - 1);
+        return max(0, $this->currentPage - 1);
     }
     public function hasNextPage() : bool
     {

199) /usr/src/myapp/src/Pagination/Paginator.php:88    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function getPreviousPage() : int
     {
-        return max(1, $this->currentPage - 1);
+        return max(2, $this->currentPage - 1);
     }
     public function hasNextPage() : bool
     {

200) /usr/src/myapp/src/Pagination/Paginator.php:88    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function getPreviousPage() : int
     {
-        return max(1, $this->currentPage - 1);
+        return max(1, $this->currentPage - 0);
     }
     public function hasNextPage() : bool
     {

201) /usr/src/myapp/src/Pagination/Paginator.php:88    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function getPreviousPage() : int
     {
-        return max(1, $this->currentPage - 1);
+        return max(1, $this->currentPage - 2);
     }
     public function hasNextPage() : bool
     {

202) /usr/src/myapp/src/Pagination/Paginator.php:88    [M] Minus

--- Original
+++ New
@@ @@
     }
     public function getPreviousPage() : int
     {
-        return max(1, $this->currentPage - 1);
+        return max(1, $this->currentPage + 1);
     }
     public function hasNextPage() : bool
     {

203) /usr/src/myapp/src/Pagination/Paginator.php:106    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->numResults > $this->pageSize;
     }
-    public function getNumResults() : int
+    protected function getNumResults() : int
     {
         return $this->numResults;
     }

204) /usr/src/myapp/src/Repository/PostRepository.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $qb = $this->createQueryBuilder('p')->addSelect('a', 't')->innerJoin('p.author', 'a')->leftJoin('p.tags', 't')->where('p.publishedAt <= :now')->orderBy('p.publishedAt', 'DESC')->setParameter('now', new \DateTime());
         if (null !== $tag) {
-            $qb->andWhere(':tag MEMBER OF p.tags')->setParameter('tag', $tag);
+            
         }
         return (new Paginator($qb))->paginate($page);
     }

205) /usr/src/myapp/src/Twig/AppExtension.php:44    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function getFunctions() : array
     {
-        return [new TwigFunction('locales', [$this, 'getLocales'])];
+        return [];
     }
     /**
      * Takes the list of codes of the locales (languages) enabled in the

206) /usr/src/myapp/src/Twig/AppExtension.php:45    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function getFunctions() : array
     {
-        return [new TwigFunction('locales', [$this, 'getLocales'])];
+        return [new TwigFunction('locales', ['getLocales'])];
     }
     /**
      * Takes the list of codes of the locales (languages) enabled in the

207) /usr/src/myapp/src/Twig/SourceCodeExtension.php:43    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function getFunctions() : array
     {
-        return [new TwigFunction('show_source_code', [$this, 'showSourceCode'], ['is_safe' => ['html'], 'needs_environment' => true])];
+        return [];
     }
     /**
      * @param string|TemplateWrapper|array $template

208) /usr/src/myapp/src/Twig/SourceCodeExtension.php:44    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function getFunctions() : array
     {
-        return [new TwigFunction('show_source_code', [$this, 'showSourceCode'], ['is_safe' => ['html'], 'needs_environment' => true])];
+        return [new TwigFunction('show_source_code', ['showSourceCode'], ['is_safe' => ['html'], 'needs_environment' => true])];
     }
     /**
      * @param string|TemplateWrapper|array $template

209) /usr/src/myapp/src/Twig/SourceCodeExtension.php:44    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function getFunctions() : array
     {
-        return [new TwigFunction('show_source_code', [$this, 'showSourceCode'], ['is_safe' => ['html'], 'needs_environment' => true])];
+        return [new TwigFunction('show_source_code', [$this, 'showSourceCode'], ['is_safe' => [], 'needs_environment' => true])];
     }
     /**
      * @param string|TemplateWrapper|array $template

210) /usr/src/myapp/src/Twig/SourceCodeExtension.php:44    [M] TrueValue

--- Original
+++ New
@@ @@
      */
     public function getFunctions() : array
     {
-        return [new TwigFunction('show_source_code', [$this, 'showSourceCode'], ['is_safe' => ['html'], 'needs_environment' => true])];
+        return [new TwigFunction('show_source_code', [$this, 'showSourceCode'], ['is_safe' => ['html'], 'needs_environment' => false])];
     }
     /**
      * @param string|TemplateWrapper|array $template

211) /usr/src/myapp/src/Twig/SourceCodeExtension.php:44    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function getFunctions() : array
     {
-        return [new TwigFunction('show_source_code', [$this, 'showSourceCode'], ['is_safe' => ['html'], 'needs_environment' => true])];
+        return [new TwigFunction('show_source_code', [$this, 'showSourceCode'], ['needs_environment' => true])];
     }
     /**
      * @param string|TemplateWrapper|array $template

212) /usr/src/myapp/src/Twig/SourceCodeExtension.php:69    [M] Throw_

--- Original
+++ New
@@ @@
         }
         $method = $this->getCallableReflector($this->controller);
         if (false === ($classCode = file($method->getFileName()))) {
-            throw new \LogicException(sprintf('There was an error while trying to read the contents of the "%s" file.', $method->getFileName()));
+            new \LogicException(sprintf('There was an error while trying to read the contents of the "%s" file.', $method->getFileName()));
         }
         $startLine = $method->getStartLine() - 1;
         $endLine = $method->getEndLine();

213) /usr/src/myapp/src/Twig/SourceCodeExtension.php:105    [M] InstanceOf_

--- Original
+++ New
@@ @@
         if (\is_array($callable)) {
             return new \ReflectionMethod($callable[0], $callable[1]);
         }
-        if (\is_object($callable) && !$callable instanceof \Closure) {
+        if (\is_object($callable) && !true) {
             $r = new \ReflectionObject($callable);
             return $r->getMethod('__invoke');
         }

214) /usr/src/myapp/src/Twig/SourceCodeExtension.php:105    [M] InstanceOf_

--- Original
+++ New
@@ @@
         if (\is_array($callable)) {
             return new \ReflectionMethod($callable[0], $callable[1]);
         }
-        if (\is_object($callable) && !$callable instanceof \Closure) {
+        if (\is_object($callable) && !false) {
             $r = new \ReflectionObject($callable);
             return $r->getMethod('__invoke');
         }

215) /usr/src/myapp/src/Twig/SourceCodeExtension.php:105    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (\is_array($callable)) {
             return new \ReflectionMethod($callable[0], $callable[1]);
         }
-        if (\is_object($callable) && !$callable instanceof \Closure) {
+        if (\is_object($callable) && $callable instanceof \Closure) {
             $r = new \ReflectionObject($callable);
             return $r->getMethod('__invoke');
         }

216) /usr/src/myapp/src/Twig/SourceCodeExtension.php:105    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if (\is_array($callable)) {
             return new \ReflectionMethod($callable[0], $callable[1]);
         }
-        if (\is_object($callable) && !$callable instanceof \Closure) {
+        if (\is_object($callable) || !$callable instanceof \Closure) {
             $r = new \ReflectionObject($callable);
             return $r->getMethod('__invoke');
         }
